{"status":200,"message":"Hadiths has been found.","hadiths":{"current_page":4,"data":[{"id":76,"hadithNumber":"76","englishNarrator":"Narrated Ibn `Abbas:","hadithEnglish":"Once I came riding a she-ass and had (just) attained the age of puberty. Allah's Messenger (ﷺ) was offering the prayer at Mina. There was no wall in front of him and I passed in front of some of the row while they were offering their prayers. There I let the she-ass loose to graze and entered the row, and nobody objected to it.","hadithUrdu":"میں ( ایک مرتبہ ) گدھی پر سوار ہو کر چلا ، اس زمانے میں ، میں بلوغ کے قریب تھا ۔ رسول اللہ صلی اللہ علیہ وسلم منیٰ میں نماز پڑھ رہے تھے اور آپ کے سامنے دیوار ( کی آڑ ) نہ تھی ، تو میں بعض صفوں کے سامنے سے گزرا اور گدھی کو چھوڑ دیا ۔ وہ چرنے لگی ، جب کہ میں صف میں شامل ہو گیا ( مگر ) کسی نے مجھے اس بات پر ٹوکا نہیں ۔","urduNarrator":"ہم سے اسماعیل نے بیان کیا ، ان سے مالک نے ، ان سے ابن شہاب نے ، ان سے عبیداللہ بن عبداللہ بن عتبہ نے ، وہ عبداللہ بن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ أَقْبَلْتُ رَاكِبًا عَلَى حِمَارٍ أَتَانٍ، وَأَنَا يَوْمَئِذٍ قَدْ نَاهَزْتُ الاِحْتِلاَمَ، وَرَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِمِنًى إِلَى غَيْرِ جِدَارٍ، فَمَرَرْتُ بَيْنَ يَدَىْ بَعْضِ الصَّفِّ وَأَرْسَلْتُ الأَتَانَ تَرْتَعُ، فَدَخَلْتُ فِي الصَّفِّ، فَلَمْ يُنْكَرْ ذَلِكَ عَلَىَّ‏.‏","headingArabic":"مَتَى يَصِحُّ سَمَاعُ الصَّغِيرِ","headingUrdu":"نوجوان کو کس عمر میں سنا جا سکتا ہے (یعنی لڑکے سے حدیث کا اقتباس قابل قبول ہے)","headingEnglish":"At what age may a youth be listened to (i.e. quotation of the Hadith from a boy be acceptable)","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":77,"hadithNumber":"77","englishNarrator":"Narrated Mahmud bin Rabi`a:","hadithEnglish":"When I was a boy of five, I remember, the Prophet (ﷺ) took water from a bucket (used for getting water out of a well) with his mouth and threw it on my face.","hadithUrdu":"( ایک مرتبہ ) رسول اللہ صلی اللہ علیہ وسلم نے ایک ڈول سے منہ میں پانی لے کر میرے چہرے پر کلی فرمائی ، اور میں اس وقت پانچ سال کا تھا ۔","urduNarrator":"ہم سے محمد بن یوسف نے بیان کیا ، ان سے ابومسہر نے ، ان سے محمد بن حرب نے ، ان سے زبیدی نے زہری کے واسطے سے بیان کیا ، وہ محمود بن الربیع سے نقل کرتے ہیں ، انھوں نے کہا کہ مجھے یاد ہے کہ","hadithArabic":"حَدَّثَنِي مُحَمَّدُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا أَبُو مُسْهِرٍ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنِ الزُّهْرِيِّ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، قَالَ عَقَلْتُ مِنَ النَّبِيِّ صلى الله عليه وسلم مَجَّةً مَجَّهَا فِي وَجْهِي وَأَنَا ابْنُ خَمْسِ سِنِينَ مِنْ دَلْوٍ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":78,"hadithNumber":"78","englishNarrator":"Narrated Ibn `Abbas:","hadithEnglish":"That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of the Prophet (ﷺ) Moses. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend (Hur) and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Messenger (ﷺ) mentioning something about him? Ubai bin Ka`b said: \"Yes, I heard the Prophet (ﷺ) mentioning something about him (saying) while Moses was sitting in the company of some Israelites, a man came and asked him: \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: '--Yes, Our slave Khadir is more learned than you. Moses asked Allah how to meet him (Al-Khadir). So Allah made the fish a sign for him and he was told when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said: 'Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said, 'That is what we have been seeking.' So they went back retracing their footsteps, and found Khadir. (and) what happened further about them is narrated in the Holy Qur'an by Allah.\" (18.54 up to 18.82)","hadithUrdu":"وہ اور حر بن قیس بن حصن فزاری حضرت موسیٰ علیہ السلام کے ساتھی کے بارے میں جھگڑے ۔ ( اس دوران میں ) ان کے پاس سے ابی بن کعب گزرے ، تو ابن عباس رضی اللہ عنہما نے انہیں بلا لیا اور کہا کہ میں اور میرے ( یہ ) ساتھی حضرت موسیٰ علیہ السلام کے ساتھی کے بارے میں بحث کر رہے ہیں جس سے ملنے کی حضرت موسیٰ علیہ السلام نے ( اللہ سے ) دعا کی تھی ۔ کیا آپ نے رسول اللہ صلی اللہ علیہ وسلم کو کچھ ان کا ذکر فرماتے ہوئے سنا ہے ؟ حضرت ابی نے کہا کہ ہاں ! میں نے رسول اللہ صلی اللہ علیہ وسلم کو ان کا حال بیان فرماتے ہوئے سنا ہے ۔ آپ فرما رہے تھے کہ ایک بار حضرت موسیٰ علیہ السلام بنی اسرائیل کی ایک جماعت میں تھے کہ اتنے میں ایک شخص آیا اور کہنے لگا کیا آپ جانتے ہیں کہ دنیا میں آپ سے بھی بڑھ کر کوئی عالم موجود ہے ۔ حضرت موسیٰ علیہ السلام نے فرمایا کہ نہیں ۔ تب اللہ تعالیٰ نے حضرت موسیٰ علیہ السلام پر وحی نازل کی کہ ہاں ہمارا بندہ خضر ( علم میں تم سے بڑھ کر ) ہے ۔ تو حضرت موسیٰ علیہ السلام نے ان سے ملنے کی راہ دریافت کی ، اس وقت اللہ تعالیٰ نے ( ان سے ملاقات کے لیے ) مچھلی کو نشانی قرار دیا اور ان سے کہہ دیا کہ جب تم مچھلی کو نہ پاؤ تو لوٹ جانا ، تب تم خضر علیہ السلام سے ملاقات کر لو گے ۔ حضرت موسیٰ علیہ السلام دریا میں مچھلی کے نشان کا انتظار کرتے رہے ۔ تب ان کے خادم نے ان سے کہا ۔ کیا آپ نے دیکھا تھا کہ جب ہم پتھر کے پاس تھے ، تو میں ( وہاں ) مچھلی بھول گیا ۔ اور مجھے شیطان ہی نے غافل کر دیا ۔ حضرت موسیٰ علیہ السلام نے کہا کہ ہم اسی ( مقام ) کے تو متلاشی تھے ، تب وہ اپنے ( قدموں کے ) نشانوں پر باتیں کرتے ہوئے واپس لوٹے ۔ ( وہاں ) خضر علیہ السلام کو انھوں نے پایا ۔ پھر ان کا قصہ وہی ہے جو اللہ تعالیٰ نے اپنی کتاب میں بیان فرمایا ہے ۔","urduNarrator":"ہم سے ابوالقاسم خالد بن خلی قاضی حمص نے بیان کیا ، ان سے محمد بن حرب نے ، اوزاعی کہتے ہیں کہ ہمیں زہری نے عبیداللہ ابن عبداللہ بن عتبہ بن مسعود سے خبر دی ، وہ حضرت عبداللہ بن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو الْقَاسِمِ، خَالِدُ بْنُ خَلِيٍّ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، قَالَ قَالَ الأَوْزَاعِيُّ أَخْبَرَنَا الزُّهْرِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى، فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ، فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ إِنِّي تَمَارَيْتُ أَنَا وَصَاحِبِي هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، هَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ فَقَالَ أُبَىٌّ نَعَمْ، سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ يَقُولُ ‏ \"‏ بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ، إِذْ جَاءَهُ رَجُلٌ فَقَالَ أَتَعْلَمُ أَحَدًا أَعْلَمَ مِنْكَ قَالَ مُوسَى لاَ‏.‏ فَأَوْحَى اللَّهُ عَزَّ وَجَلَّ إِلَى مُوسَى بَلَى، عَبْدُنَا خَضِرٌ، فَسَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ، فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً، وَقِيلَ لَهُ إِذَا فَقَدْتَ الْحُوتَ فَارْجِعْ، فَإِنَّكَ سَتَلْقَاهُ، فَكَانَ مُوسَى صلى الله عليه وسلم يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ‏.‏ فَقَالَ فَتَى مُوسَى لِمُوسَى أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ، وَمَا أَنْسَانِيهِ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ‏.‏ قَالَ مُوسَى ذَلِكَ مَا كُنَّا نَبْغِي‏.‏ فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا، فَوَجَدَا خَضِرًا، فَكَانَ مِنْ شَأْنِهِمَا مَا قَصَّ اللَّهُ فِي كِتَابِهِ ‏\"‏‏.‏","headingArabic":"الْخُرُوجِ فِي طَلَبِ الْعِلْمِ","headingUrdu":"علم کی تلاش میں نکلنا","headingEnglish":"To go out in search of knowledge","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":79,"hadithNumber":"79","englishNarrator":"Narrated Abu Musa:","hadithEnglish":"The Prophet (ﷺ) said, \"The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water and Allah benefited the people with it and they utilized it for drinking, making their animals drink from it and for irrigation of the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which Allah has revealed through me (the Prophets and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah's guidance revealed through me (He is like that barren land.)\"","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے فرمایا کہ اللہ تعالیٰ نے مجھے جس علم و ہدایت کے ساتھ بھیجا ہے اس کی مثال زبردست بارش کی سی ہے جو زمین پر ( خوب ) برسے ۔ بعض زمین جو صاف ہوتی ہے وہ پانی کو پی لیتی ہے اور بہت بہت سبزہ اور گھاس اگاتی ہے اور بعض زمین جو سخت ہوتی ہے وہ پانی کو روک لیتی ہے اس سے اللہ تعالیٰ لوگوں کو فائدہ پہنچاتا ہے ۔ وہ اس سے سیراب ہوتے ہیں اور سیراب کرتے ہیں ۔ اور کچھ زمین کے بعض خطوں پر پانی پڑتا ہے جو بالکل چٹیل میدان ہوتے ہیں ۔ نہ پانی روکتے ہیں اور نہ ہی سبزہ اگاتے ہیں ۔ تو یہ اس شخص کی مثال ہے جو دین میں سمجھ پیدا کرے اور نفع دے ، اس کو وہ چیز جس کے ساتھ میں مبعوث کیا گیا ہوں ۔ اس نے علم دین سیکھا اور سکھایا اور اس شخص کی مثال جس نے سر نہیں اٹھایا ( یعنی توجہ نہیں کی ) اور جو ہدایت دے کر میں بھیجا گیا ہوں اسے قبول نہیں کیا ۔ حضرت امام بخاری رحمہ اللہ فرماتے ہیں کہ ابن اسحاق نے ابواسامہ کی روایت سے «قبلت الماء» کا لفظ نقل کیا ہے ۔ قاعاس خطہٰ زمین کو کہتے ہیں جس پر پانی چڑھ جائے ( مگر ٹھہرے نہیں ) اور «صفصف» اس زمین کو کہتے ہیں جو بالکل ہموار ہو ۔","urduNarrator":"ہم سے محمد بن علاء نے بیان کیا ، ان سے حماد بن اسامہ نے برید بن عبداللہ کے واسطے سے نقل کیا ، وہ ابی بردہ سے روایت کرتے ہیں ، وہ حضرت ابوموسیٰ سے اور وہ نبی کریم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ مَثَلُ مَا بَعَثَنِي اللَّهُ بِهِ مِنَ الْهُدَى وَالْعِلْمِ كَمَثَلِ الْغَيْثِ الْكَثِيرِ أَصَابَ أَرْضًا، فَكَانَ مِنْهَا نَقِيَّةٌ قَبِلَتِ الْمَاءَ، فَأَنْبَتَتِ الْكَلأَ وَالْعُشْبَ الْكَثِيرَ، وَكَانَتْ مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ، فَنَفَعَ اللَّهُ بِهَا النَّاسَ، فَشَرِبُوا وَسَقَوْا وَزَرَعُوا، وَأَصَابَتْ مِنْهَا طَائِفَةً أُخْرَى، إِنَّمَا هِيَ قِيعَانٌ لاَ تُمْسِكُ مَاءً، وَلاَ تُنْبِتُ كَلأً، فَذَلِكَ مَثَلُ مَنْ فَقِهَ فِي دِينِ اللَّهِ وَنَفَعَهُ مَا بَعَثَنِي اللَّهُ بِهِ، فَعَلِمَ وَعَلَّمَ، وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا، وَلَمْ يَقْبَلْ هُدَى اللَّهِ الَّذِي أُرْسِلْتُ بِهِ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ إِسْحَاقُ وَكَانَ مِنْهَا طَائِفَةٌ قَيَّلَتِ الْمَاءَ‏.‏ قَاعٌ يَعْلُوهُ الْمَاءُ، وَالصَّفْصَفُ الْمُسْتَوِي مِنَ الأَرْضِ‏.‏","headingArabic":"فَضْلِ مَنْ عَلِمَ وَعَلَّمَ","headingUrdu":"اس شخص کی برتری جو اسلام سیکھتا ہے اور پھر دوسروں کو سکھاتا ہے","headingEnglish":"The superiority of a person who learns (Islam, becomes a religious scholar) and then teaches it to others","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":80,"hadithNumber":"80","englishNarrator":"Narrated Anas:","hadithEnglish":"Allah's Messenger (ﷺ) said, \"From among the portents of the Hour are (the following): \r\n1. Religious knowledge will be taken away (by the death of Religious learned men). \r\n2. (Religious) ignorance will prevail.\r\n3. Drinking of Alcoholic drinks (will be very common).\r\n4. There will be prevalence of open illegal sexual intercourse.","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ۔ علامات قیامت میں سے یہ ہے کہ ( دینی ) علم اٹھ جائے گا اور جہل ہی جہل ظاہر ہو جائے گا ۔ اور ( علانیہ ) شراب پی جائے گی اور زنا پھیل جائے گا ۔","urduNarrator":"ہم سے عمران بن میسرہ نے بیان کیا ، ان سے عبدالوارث نے ابوالتیاح کے واسطے سے نقل کیا ، وہ حضرت انس سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ، وَيَثْبُتَ الْجَهْلُ، وَيُشْرَبَ الْخَمْرُ، وَيَظْهَرَ الزِّنَا ‏\"‏‏.‏","headingArabic":"رَفْعِ الْعِلْمِ وَظُهُورِ الْجَهْلِ","headingUrdu":"(دینی) علم کے غائب ہونے اور (مذہبی) جہالت کے ظاہر ہونے کے بارے میں (کیا کہا جاتا ہے)","headingEnglish":"(What is said regarding) the disappearance of the (religious) knowledge and the appearance of (religious) ignorance","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":81,"hadithNumber":"81","englishNarrator":"Narrated Anas:","hadithEnglish":"I will narrate to you a Hadith and none other than I will tell you about after it. I heard Allah's Messenger (ﷺ) saying: From among the portents of the Hour are (the following): \r\n1. Religious knowledge will decrease (by the death of religious learned men). \r\n2. Religious ignorance will prevail. \r\n3. There will be prevalence of open illegal sexual intercourse. \r\n4. Women will increase in number and men will decrease in number so much so that fifty women will be looked after by one man.","hadithUrdu":"میں تم سے ایک ایسی حدیث بیان کرتا ہوں جو میرے بعد تم سے کوئی نہیں بیان کرے گا ، میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا کہ علامات قیامت میں سے یہ ہے کہ علم ( دین ) کم ہو جائے گا ۔ جہل ظاہر ہو جائے گا ۔ زنا بکثرت ہو گا ۔ عورتیں بڑھ جائیں گی اور مرد کم ہو جائیں گے ۔ حتیٰ کہ 50 عورتوں کا نگراں صرف ایک مرد رہ جائے گا ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ان سے یحییٰ نے شعبہ سے نقل کیا ، وہ قتادہ سے اور قتادہ حضرت انس سے روایت کرتے ہیں ، انھوں نے فرمایا کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا يَحْيَى، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ لأُحَدِّثَنَّكُمْ حَدِيثًا لاَ يُحَدِّثُكُمْ أَحَدٌ بَعْدِي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يَقِلَّ الْعِلْمُ، وَيَظْهَرَ الْجَهْلُ، وَيَظْهَرَ الزِّنَا، وَتَكْثُرَ النِّسَاءُ وَيَقِلَّ الرِّجَالُ، حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":82,"hadithNumber":"82","englishNarrator":"Narrated Ibn `Umar:","hadithEnglish":"Allah's Messenger (ﷺ) said, \"While I was sleeping, I saw that a cup full of milk was brought to me and I drank my fill till I noticed (the milk) its wetness coming out of my nails. Then I gave the remaining milk to `Umar Ibn Al-Khattab\" The companions of the Prophet (ﷺ) asked, \"What have you interpreted (about this dream)? \"O Allah's Messenger (ﷺ) ,!\" he replied, \"(It is religious) knowledge.\"","hadithUrdu":"میں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ فرماتے ہوئے سنا ہے کہ میں سو رہا تھا ( اسی حالت میں ) مجھے دودھ کا ایک پیالہ دیا گیا ۔ میں نے ( خوب اچھی طرح ) پی لیا ۔ حتیٰ کہ میں نے دیکھا کہ تازگی میرے ناخنوں سے نکل رہی ہے ۔ پھر میں نے اپنا بچا ہوا ( دودھ ) عمر بن الخطاب کو دے دیا ۔ صحابہ رضی اللہ عنہم نے پوچھا آپ نے اس کی کیا تعبیر لی ؟ آپ صلی اللہ علیہ وسلم نے فرمایا علم ۔","urduNarrator":"ہم سے سعید بن عفیر نے بیان کیا ، انھوں نے کہا مجھ سے لیث نے ، ان سے عقیل نے ابن شہاب کے واسطے سے نقل کیا ، وہ حمزہ بن عبداللہ بن عمر سے نقل کرتے ہیں کہ حضرت عبداللہ بن عمر رضی اللہ عنہما نے فرمایا","hadithArabic":"حَدَّثَنَا سَعِيدُ بْنُ عُفَيْرٍ، قَالَ حَدَّثَنِي اللَّيْثُ، قَالَ حَدَّثَنِي عُقَيْلٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ ابْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ بَيْنَا أَنَا نَائِمٌ أُتِيتُ بِقَدَحِ لَبَنٍ، فَشَرِبْتُ حَتَّى إِنِّي لأَرَى الرِّيَّ يَخْرُجُ فِي أَظْفَارِي، ثُمَّ أَعْطَيْتُ فَضْلِي عُمَرَ بْنَ الْخَطَّابِ ‏\"‏‏.‏ قَالُوا فَمَا أَوَّلْتَهُ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ الْعِلْمَ ‏\"‏‏.‏","headingArabic":"فَضْلِ الْعِلْمِ","headingUrdu":"(دینی) علم کی برتری","headingEnglish":"The superiority of (religious) knowledge","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":83,"hadithNumber":"83","englishNarrator":"Narrated `Abdullah bin `Amr bin Al `Aas:","hadithEnglish":"Allah's Messenger (ﷺ) stopped (for a while near the Jimar) at Mina during his last Hajj for the people and they were asking him questions. A man came and said, \"I forgot and got my head shaved before slaughtering the Hadi (sacrificing animal).\" The Prophet (ﷺ) said, \"There is no harm, go and do the slaughtering now.\" Then another person came and said, \"I forgot and slaughtered (the camel) before Rami (throwing of the pebbles) at the Jamra.\" The Prophet (ﷺ) said, \"Do the Rami now and there is no harm.\" The narrator added: So on that day, when the Prophet (ﷺ) was asked about anything (as regards the ceremonies of Hajj) performed before or after its due time, his reply was: \"Do it (now) and there is no harm.\"","hadithUrdu":"حجۃ الوداع میں رسول اللہ صلی اللہ علیہ وسلم لوگوں کے مسائل دریافت کرنے کی وجہ سے منیٰ میں ٹھہر گئے ۔ تو ایک شخص آیا اور اس نے کہا کہ میں نے بےخبری میں ذبح کرنے سے پہلے سر منڈا لیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ( اب ) ذبح کر لے اور کچھ حرج نہیں ۔ پھر دوسرا آدمی آیا ، اس نے کہا کہ میں نے بےخبری میں رمی کرنے سے پہلے قربانی کر لی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ( اب ) رمی کر لے ۔ ( اور پہلے کر دینے سے ) کچھ حرج نہیں ۔ ابن عمرو کہتے ہیں ( اس دن ) آپ صلی اللہ علیہ وسلم سے جس چیز کا بھی سوال ہوا ، جو کسی نے آگے اور پیچھے کر لی تھی ۔ تو آپ صلی اللہ علیہ وسلم نے یہی فرمایا کہ اب کر لے اور کچھ حرج نہیں ۔","urduNarrator":"ہم سے اسماعیل نے بیان کیا ، ان سے مالک نے ابن شہاب کے واسطے سے بیان کیا ، وہ عیسیٰ بن طلحہ بن عبیداللہ سے روایت کرتے ہیں ، وہ عبداللہ بن عمرو بن العاص سے نقل کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عِيسَى بْنِ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَقَفَ فِي حَجَّةِ الْوَدَاعِ بِمِنًى لِلنَّاسِ يَسْأَلُونَهُ، فَجَاءَهُ رَجُلٌ فَقَالَ لَمْ أَشْعُرْ فَحَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ فَقَالَ ‏\"‏ اذْبَحْ وَلاَ حَرَجَ ‏\"‏‏.‏ فَجَاءَ آخَرُ فَقَالَ لَمْ أَشْعُرْ، فَنَحَرْتُ قَبْلَ أَنْ أَرْمِيَ‏.‏ قَالَ ‏\"‏ ارْمِ وَلاَ حَرَجَ ‏\"‏‏.‏ فَمَا سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ شَىْءٍ قُدِّمَ وَلاَ أُخِّرَ إِلاَّ قَالَ افْعَلْ وَلاَ حَرَجَ‏.‏","headingArabic":"الْفُتْيَا وَهُوَ وَاقِفٌ عَلَى الدَّابَّةِ وَغَيْرِهَا","headingUrdu":"کسی جانور پر سوار ہو کر یا کسی اور چیز پر کھڑے ہو کر مذہبی فیصلہ دینا","headingEnglish":"To give a religious verdict while riding an animal or standing on anything else","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":84,"hadithNumber":"84","englishNarrator":"Narrated Ibn `Abbas:","hadithEnglish":"Somebody said to the Prophet (during his last Hajj), \"I did the slaughtering before doing the Rami.' The Prophet (ﷺ) beckoned with his hand and said, \"There is no harm in that.\" Then another person said. \"I got my head shaved before offering the sacrifice.\" The Prophet (ﷺ) beckoned with his hand saying, \"There is no harm in that.\"","hadithUrdu":"نبی کریم صلی اللہ علیہ وسلم سے آپ کے ( آخری ) حج میں کسی نے پوچھا کہ میں نے رمی کرنے ( یعنی کنکر پھینکنے ) سے پہلے ذبح کر لیا ، آپ صلی اللہ علیہ وسلم نے ہاتھ سے اشارہ کیا ( اور ) فرمایا کچھ حرج نہیں ۔ کسی نے کہا کہ میں نے ذبح سے پہلے حلق کرا لیا ۔ آپ صلی اللہ علیہ وسلم نے سر سے اشارہ فرما دیا کہ کچھ حرج نہیں ۔","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ان سے وہیب نے ، ان سے ایوب نے عکرمہ کے واسطے سے نقل کیا ، وہ حضرت ابن عباس رضی اللہ عنہما سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا أَيُّوبُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ فِي حَجَّتِهِ فَقَالَ ذَبَحْتُ قَبْلَ أَنْ أَرْمِيَ، فَأَوْمَأَ بِيَدِهِ قَالَ وَلاَ حَرَجَ‏.‏ قَالَ حَلَقْتُ قَبْلَ أَنْ أَذْبَحَ‏.‏ فَأَوْمَأَ بِيَدِهِ وَلاَ حَرَجَ‏.‏","headingArabic":"مَنْ أَجَابَ الْفُتْيَا بِإِشَارَةِ الْيَدِ وَالرَّأْسِ","headingUrdu":"جس نے بھی اشارے سے یا سر ہلا کر مذہبی فیصلہ دیا۔","headingEnglish":"Whoever gave a religious verdict by beckoning or by nodding","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":85,"hadithNumber":"85","englishNarrator":"Narrated Abu Huraira:","hadithEnglish":"The Prophet (ﷺ) said, \"(Religious) knowledge will be taken away (by the death of religious scholars) ignorance (in religion) and afflictions will appear; and Harj will increase.\" It was asked, \"What is Harj, O Allah's Messenger (ﷺ)?\" He replied by beckoning with his hand indicating \"killing.\" (Fath-al-Bari Page 192, Vol. 1)","hadithUrdu":"آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( ایک وقت ایسا آئے گا کہ جب ) علم اٹھا لیا جائے گا ۔ جہالت اور فتنے پھیل جائیں گے اور ہرج بڑھ جائے گا ۔ آپ سے پوچھا گیا کہ یا رسول اللہ ! ہرج سے کیا مراد ہے ؟ آپ صلی اللہ علیہ وسلم نے اپنے ہاتھ کو حرکت دے کر فرمایا اس طرح ، گویا آپ صلی اللہ علیہ وسلم نے اس سے قتل مراد لیا ۔","urduNarrator":"ہم سے مکی ابن ابراہیم نے بیان کیا ، انہیں حنظلہ نے سالم سے خبر دی ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے سنا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں","hadithArabic":"حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ سَالِمٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ يُقْبَضُ الْعِلْمُ، وَيَظْهَرُ الْجَهْلُ وَالْفِتَنُ، وَيَكْثُرُ الْهَرْجُ ‏\"‏‏.‏ قِيلَ يَا رَسُولَ اللَّهِ وَمَا الْهَرْجُ فَقَالَ هَكَذَا بِيَدِهِ، فَحَرَّفَهَا، كَأَنَّهُ يُرِيدُ الْقَتْلَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":86,"hadithNumber":"86","englishNarrator":"Narrated Asma':","hadithEnglish":"I came to `Aisha while she was praying, and said to her, \"What has happened to the people?\" She pointed out towards the sky. (I looked towards the mosque), and saw the people offering the prayer. Aisha said, \"Subhan Allah.\" I said to her, \"Is there a sign?\" She nodded with her head meaning, \"Yes.\" I, too, then stood (for the prayer of eclipse) till I became (nearly) unconscious and later on I poured water on my head. After the prayer, the Prophet (ﷺ) praised and glorified Allah and then said, \"Just now at this place I have seen what I have never seen before, including Paradise and Hell. No doubt it has been inspired to me that you will be put to trials in your graves and these trials will be like the trials of Masih-ad-Dajjal or nearly like it (the sub narrator is not sure which expression Asma' used). You will be asked, 'What do you know about this man (the Prophet (ﷺ) Muhammad)?' Then the faithful believer (or Asma' said a similar word) will reply, 'He is Muhammad Allah's Messenger (ﷺ) who had come to us with clear evidences and guidance and so we accepted his teachings and followed him. And he is Muhammad.' And he will repeat it thrice. Then the angels will say to him, 'Sleep in peace as we have come to know that you were a faithful believer.' On the other hand, a hypocrite or a doubtful person will reply, 'I do not know, but I heard the people saying something and so I said it.' (the same). \"","hadithUrdu":"میں عائشہ رضی اللہ عنہا کے پاس آئی ، وہ نماز پڑھ رہی تھیں ، میں نے کہا کہ لوگوں کا کیا حال ہے ؟ تو انھوں نے آسمان کی طرف اشارہ کیا ( یعنی سورج کو گہن لگا ہے ) اتنے میں لوگ ( نماز کے لیے ) کھڑے ہو گئے ۔ حضرت عائشہ رضی اللہ عنہا نے کہا ، اللہ پاک ہے ۔ میں نے کہا ( کیا یہ گہن ) کوئی ( خاص ) نشانی ہے ؟ انھوں نے سر سے اشارہ کیا یعنی ہاں ! پھر میں ( بھی نماز کے لیے ) کھڑی ہو گئی ۔ حتیٰ کہ مجھے غش آنے لگا ، تو میں اپنے سر پر پانی ڈالنے لگی ۔ پھر ( نماز کے بعد ) رسول اللہ صلی اللہ علیہ وسلم نے اللہ تعالیٰ کی تعریف اور اس کی صفت بیان فرمائی ، پھر فرمایا ، جو چیز مجھے پہلے دکھلائی نہیں گئی تھی آج وہ سب اس جگہ میں نے دیکھ لی ، یہاں تک کہ جنت اور دوزخ کو بھی دیکھ لیا اور مجھ پر یہ وحی کی گئی کہ تم اپنی قبروں میں آزمائے جاؤ گے ، «مثل» یا «قرب» کا کون سا لفظ حضرت اسماء نے فرمایا ، میں نہیں جانتی ، فاطمہ کہتی ہیں ( یعنی ) فتنہ دجال کی طرح ( آزمائے جاؤ گے ) کہا جائے گا ( قبر کے اندر کہ ) تم اس آدمی کے بارے میں کیا جانتے ہو ؟ تو جو صاحب ایمان یا صاحب یقین ہو گا ، کون سا لفظ فرمایا حضرت اسماء رضی اللہ عنہا نے ، مجھے یاد نہیں ۔ وہ کہے گا وہ محمد اللہ کے رسول صلی اللہ علیہ وسلم ہیں ، جو ہمارے پاس اللہ کی ہدایت اور دلیلیں لے کر آئے تو ہم نے ان کو قبول کر لیا اور ان کی پیروی کی وہ محمد صلی اللہ علیہ وسلم ہیں ۔ تین بار ( اسی طرح کہے گا ) پھر ( اس سے ) کہہ دیا جائے گا کہ آرام سے سو جا بیشک ہم نے جان لیا کہ تو محمد صلی اللہ علیہ وسلم پر یقین رکھتا تھا ۔ اور بہرحال منافق یا شکی آدمی ، میں نہیں جانتی کہ ان میں سے کون سا لفظ حضرت اسماء رضی اللہ عنہا نے کہا ۔ تو وہ ( منافق یا شکی آدمی ) کہے گا کہ جو لوگوں کو میں نے کہتے سنا میں نے ( بھی ) وہی کہہ دیا ۔ ( باقی میں کچھ نہیں جانتا ۔ )","urduNarrator":"ہم سے موسیٰ بن اسماعیل نے بیان کیا ، ان سے وہیب نے ، ان سے ہشام نے فاطمہ کے واسطے سے نقل کیا ، وہ اسماء سے روایت کرتی ہیں کہ","hadithArabic":"حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ أَتَيْتُ عَائِشَةَ وَهِيَ تُصَلِّي فَقُلْتُ مَا شَأْنُ النَّاسِ فَأَشَارَتْ إِلَى السَّمَاءِ، فَإِذَا النَّاسُ قِيَامٌ، فَقَالَتْ سُبْحَانَ اللَّهِ‏.‏ قُلْتُ آيَةٌ فَأَشَارَتْ بِرَأْسِهَا، أَىْ نَعَمْ، فَقُمْتُ حَتَّى تَجَلاَّنِي الْغَشْىُ، فَجَعَلْتُ أَصُبُّ عَلَى رَأْسِي الْمَاءَ، فَحَمِدَ اللَّهَ عَزَّ وَجَلَّ النَّبِيُّ صلى الله عليه وسلم وَأَثْنَى عَلَيْهِ، ثُمَّ قَالَ ‏ \"‏ مَا مِنْ شَىْءٍ لَمْ أَكُنْ أُرِيتُهُ إِلاَّ رَأَيْتُهُ فِي مَقَامِي حَتَّى الْجَنَّةَ وَالنَّارَ، فَأُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي قُبُورِكُمْ، مِثْلَ ـ أَوْ قَرِيبًا لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، يُقَالُ مَا عِلْمُكَ بِهَذَا الرَّجُلِ فَأَمَّا الْمُؤْمِنُ ـ أَوِ الْمُوقِنُ لاَ أَدْرِي بِأَيِّهِمَا قَالَتْ أَسْمَاءُ ـ فَيَقُولُ هُوَ مُحَمَّدٌ رَسُولُ اللَّهِ جَاءَنَا بِالْبَيِّنَاتِ وَالْهُدَى، فَأَجَبْنَا وَاتَّبَعْنَا، هُوَ مُحَمَّدٌ‏.‏ ثَلاَثًا، فَيُقَالُ نَمْ صَالِحًا، قَدْ عَلِمْنَا إِنْ كُنْتَ لَمُوقِنًا بِهِ، وَأَمَّا الْمُنَافِقُ ـ أَوِ الْمُرْتَابُ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَتْ أَسْمَاءُ ـ فَيَقُولُ لاَ أَدْرِي، سَمِعْتُ النَّاسَ يَقُولُونَ شَيْئًا فَقُلْتُهُ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":87,"hadithNumber":"87","englishNarrator":"Narrated Abu Jamra:","hadithEnglish":"I was an interpreter between the people and Ibn `Abbas. Once Ibn `Abbas said that a delegation of the tribe of `Abdul Qais came to the Prophet (ﷺ) who asked them, \"Who are the people (i.e. you)? (Or) who are the delegates?\" They replied, \"We are from the tribe of Rabi`a.\" Then the Prophet (ﷺ) said to them, \"Welcome, O people (or said, \"O delegation (of `Abdul Qais).\") Neither will you have disgrace nor will you regret.\" They said, \"We have come to you from a distant place and there is the tribe of the infidels of Mudar intervening between you and us and we cannot come to you except in the sacred month. So please order us to do something good (religious deeds) and that we may also inform our people whom we have left behind (at home) and that we may enter Paradise (by acting on them.)\" The Prophet ordered them to do four things, and forbade them from four things. He ordered them to believe in Allah Alone, the Honorable the Majestic and said to them, \"Do you know what is meant by believing in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet (ﷺ) said, \"(That means to testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to observe fasts during the month of Ramadan, (and) to pay Al-Khumus (one fifth of the booty to be given in Allah's cause).\" Then he forbade them four things, namely Ad-Dubba.' Hantam, Muzaffat (and) An-Naqir or Muqaiyar (These were the names of pots in which alcoholic drinks used to be prepared). The Prophet (ﷺ) further said, \"Memorize them (these instructions) and tell them to the people whom you have left behind.\"","hadithUrdu":"میں ابن عباس رضی اللہ عنہما اور لوگوں کے درمیان ترجمانی کے فرائض انجام دیتا تھا ( ایک مرتبہ ) ابن عباس رضی اللہ عنہما نے کہا کہ قبیلہ عبدالقیس کا وفد رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آیا ۔ آپ صلی اللہ علیہ وسلم نے دریافت فرمایا کہ کون سا وفد ہے ؟ یا یہ کون لوگ ہیں ؟ انھوں نے کہا کہ ربیعہ خاندان ( کے لوگ ہیں ) آپ صلی اللہ علیہ وسلم نے فرمایا کہ مبارک ہو قوم کو ( آنا ) یا مبارک ہو اس وفد کو ( جو کبھی ) نہ رسوا ہو نہ شرمندہ ہو ( اس کے بعد ) انھوں نے عرض کیا کہ ہم ایک دور دراز کونے سے آپ صلی اللہ علیہ وسلم کے پاس آئے ہیں اور ہمارے اور آپ کے درمیان کفار مضر کا یہ قبیلہ ( پڑتا ) ہے ( اس کے خوف کی وجہ سے ) ہم حرمت والے مہینوں کے علاوہ اور ایام میں نہیں آ سکتے ۔ اس لیے ہمیں کوئی ایسی ( قطعی ) بات بتلا دیجیئے کہ جس کی ہم اپنے پیچھے رہ جانے والے لوگوں کو خبر دے دیں ۔ ( اور ) اس کی وجہ سے ہم جنت میں داخل ہو سکیں ۔ تو آپ صلی اللہ علیہ وسلم نے انہیں چار باتوں کا حکم دیا اور چار سے روک دیا ۔ اول انہیں حکم دیا کہ ایک اللہ پر ایمان لائیں ۔ ( پھر ) فرمایا کہ کیا تم جانتے ہو کہ ایک اللہ پر ایمان لانے کا کیا مطلب ہے ؟ انھوں نے عرض کیا ، اللہ اور اس کا رسول زیادہ جانتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ( ایک اللہ پر ایمان لانے کا مطلب یہ ہے کہ ) اس بات کا اقرار کرنا کہ اللہ کے سوا کوئی معبود نہیں اور یہ کہ محمد ( صلی اللہ علیہ وسلم ) اللہ کے سچے رسول ہیں اور نماز قائم کرنا ، زکوٰۃ ادا کرنا اور ماہ رمضان کے روزے رکھنا اور یہ کہ تم مال غنیمت سے پانچواں حصہ ادا کرو اور چار چیزوں سے منع فرمایا ، دباء ، حنتم ، اور مزفت کے استعمال سے ۔ اور ( چوتھی چیز کے بارے میں ) شعبہ کہتے ہیں کہ ابوجمرہ بسا اوقات «نقير» کہتے تھے اور بسا اوقات «مقير‏» ۔ ( اس کے بعد ) رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ ان ( باتوں کو ) یاد رکھو اور اپنے پیچھے ( رہ جانے ) والوں کو بھی ان کی خبر کر دو ۔","urduNarrator":"ہم سے محمد بن بشار نے بیان کیا ، ان سے غندر نے ، ان سے شعبہ نے ابوجمرہ کے واسطے سے بیان کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا غُنْدَرٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ كُنْتُ أُتَرْجِمُ بَيْنَ ابْنِ عَبَّاسٍ وَبَيْنَ النَّاسِ فَقَالَ إِنَّ وَفْدَ عَبْدِ الْقَيْسِ أَتَوُا النَّبِيَّ صلى الله عليه وسلم فَقَالَ ‏\"‏ مَنِ الْوَفْدُ ـ أَوْ مَنِ الْقَوْمُ ‏\"‏‏.‏ قَالُوا رَبِيعَةُ‏.‏ فَقَالَ ‏\"‏ مَرْحَبًا بِالْقَوْمِ ـ أَوْ بِالْوَفْدِ ـ غَيْرَ خَزَايَا وَلاَ نَدَامَى ‏\"‏‏.‏ قَالُوا إِنَّا نَأْتِيكَ مِنْ شُقَّةٍ بَعِيدَةٍ، وَبَيْنَنَا وَبَيْنَكَ هَذَا الْحَىُّ مِنْ كُفَّارِ مُضَرَ، وَلاَ نَسْتَطِيعُ أَنْ نَأْتِيَكَ إِلاَّ فِي شَهْرٍ حَرَامٍ فَمُرْنَا بِأَمْرٍ نُخْبِرْ بِهِ مَنْ وَرَاءَنَا، نَدْخُلُ بِهِ الْجَنَّةَ‏.‏ فَأَمَرَهُمْ بِأَرْبَعٍ، وَنَهَاهُمْ عَنْ أَرْبَعٍ أَمَرَهُمْ بِالإِيمَانِ بِاللَّهِ عَزَّ وَجَلَّ وَحْدَهُ‏.‏ قَالَ ‏\"‏ هَلْ تَدْرُونَ مَا الإِيمَانُ بِاللَّهِ وَحْدَهُ ‏\"‏‏.‏ قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ‏.‏ قَالَ ‏\"‏ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامُ الصَّلاَةِ، وَإِيتَاءُ الزَّكَاةِ، وَصَوْمُ رَمَضَانَ، وَتُعْطُوا الْخُمُسَ مِنَ الْمَغْنَمِ ‏\"‏‏.‏ وَنَهَاهُمْ عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالْمُزَفَّتِ‏.‏ قَالَ شُعْبَةُ رُبَّمَا قَالَ النَّقِيرِ، وَرُبَّمَا قَالَ الْمُقَيَّرِ‏.‏ قَالَ ‏\"‏ احْفَظُوهُ وَأَخْبِرُوهُ مَنْ وَرَاءَكُمْ ‏\"‏‏.‏","headingArabic":"تَحْرِيضِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَفْدَ عَبْدِ الْقَيْسِ عَلَى أَنْ يَحْفَظُوا الإِيمَانَ وَالْعِلْمَ وَيُخْبِرُوا مَنْ وَرَاءَهُمْ","headingUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے عبدالقیس کے لوگوں (مشن) کو تاکید کی کہ وہ ایمان اور (دینی) علم کو یاد رکھیں (جیسا کہ انہوں نے انہیں سمجھا دیا) اور اپنے لوگوں کو (پہنچائیں) جنہیں وہ (گھر میں) چھوڑ گئے تھے۔","headingEnglish":"The Prophet (saws) urged the people (mission) of 'Abdul Qais to memorize the faith and the (religious) knowledge (as he explained to them) and to inform (convey) to their people whom they left behind (at home)","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":88,"hadithNumber":"88","englishNarrator":"Narrated `Abdullah bin Abi Mulaika:","hadithEnglish":"`Uqba bin Al-Harith said that he had married the daughter of Abi Ihab bin `Aziz. Later on a woman came to him and said, \"I have suckled (nursed) `Uqba and the woman whom he married (his wife) at my breast.\" `Uqba said to her, \"Neither I knew that you have suckled (nursed) me nor did you tell me.\" Then he rode over to see Allah's Messenger (ﷺ) at Medina, and asked him about it. Allah's Messenger (ﷺ) said, \"How can you keep her as a wife when it has been said (that she is your foster-sister)?\" Then `Uqba divorced her, and she married another man.","hadithUrdu":"عقبہ نے ابواہاب بن عزیز کی لڑکی سے نکاح کیا تو ان کے پاس ایک عورت آئی اور کہنے لگی کہ میں نے عقبہ کو اور جس سے اس کا نکاح ہوا ہے ، اس کو دودھ پلایا ہے ۔ نہ تو نے کبھی مجھے بتایا ہے ۔ ( یہ سن کر ) عقبہ نے کہا ، مجھے نہیں معلوم کہ تو نے مجھے دودھ پلایا ہے اور نہ تو نے کبھی مجھے بتایا ہے ۔ تب عقبہ سوار ہو کر رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں مدینہ منورہ حاضر ہوئے اور آپ سے اس کے متعلق دریافت کیا ، تو آپ صلی اللہ علیہ وسلم نے فرمایا ، کس طرح ( تم اس لڑکی سے رشتہ رکھو گے ) حالانکہ ( اس کے متعلق یہ ) کہا گیا تب عقبہ بن حارث نے اس لڑکی کو چھوڑ دیا اور اس نے دوسرا خاوند کر لیا ۔","urduNarrator":"ہم سے ابوالحسن محمد بن مقاتل نے بیان کیا ، انہیں عبداللہ نے خبر دی ، انہیں عمر بن سعید بن ابی حسین نے خبر دی ، ان سے عبداللہ بن ابی ملیکہ نے عقبہ ابن الحارث کے واسطے سے نقل کیا کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ مُقَاتِلٍ أَبُو الْحَسَنِ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا عُمَرُ بْنُ سَعِيدِ بْنِ أَبِي حُسَيْنٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ أَبِي مُلَيْكَةَ، عَنْ عُقْبَةَ بْنِ الْحَارِثِ، أَنَّهُ تَزَوَّجَ ابْنَةً لأَبِي إِهَابِ بْنِ عَزِيزٍ، فَأَتَتْهُ امْرَأَةٌ فَقَالَتْ إِنِّي قَدْ أَرْضَعْتُ عُقْبَةَ وَالَّتِي تَزَوَّجَ بِهَا‏.‏ فَقَالَ لَهَا عُقْبَةُ مَا أَعْلَمُ أَنَّكِ أَرْضَعْتِنِي وَلاَ أَخْبَرْتِنِي‏.‏ فَرَكِبَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ فَسَأَلَهُ، فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ كَيْفَ وَقَدْ قِيلَ ‏\"‏‏.‏ فَفَارَقَهَا عُقْبَةُ، وَنَكَحَتْ زَوْجًا غَيْرَهُ‏.‏","headingArabic":"الرِّحْلَةِ فِي الْمَسْأَلَةِ النَّازِلَةِ وَتَعْلِيمِ أَهْلِهِ","headingUrdu":"کسی مشکل معاملے کا جواب تلاش کرنے کے لیے سفر کرنا، اور اسے اپنے گھر والوں کو سکھانا","headingEnglish":"To travel seeking an answer to a problematic matter, and to teach it to one's family","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":89,"hadithNumber":"89","englishNarrator":"Narrated `Umar:","hadithEnglish":"My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to visit the Prophet (ﷺ) by turns. He used to go one day and I another day. When I went I used to bring the news of that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked violently at my door and asked if I was there.\" I became horrified and came out to him. He said, \"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did Allah's Messenger (ﷺ) divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet (ﷺ) and said while standing, \"Have you divorced your wives?\" The Prophet (ﷺ) replied in the negative. On that I said, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)","hadithUrdu":"میں اور میرا ایک انصاری پڑوسی دونوں اطراف مدینہ کے ایک گاؤں بنی امیہ بن زید میں رہتے تھے جو مدینہ کے ( پورب کی طرف ) بلند گاؤں میں سے ہے ۔ ہم دونوں باری باری آنحضرت صلی اللہ علیہ وسلم کی خدمت شریف میں حاضر ہوا کرتے تھے ۔ ایک دن وہ آتا ، ایک دن میں آتا ۔ جس دن میں آتا اس دن کی وحی کی اور ( رسول اللہ صلی اللہ علیہ وسلم کی فرمودہ ) دیگر باتوں کی اس کو خبر دے دیتا تھا اور جب وہ آتا تھا تو وہ بھی اسی طرح کرتا ۔ تو ایک دن وہ میرا انصاری ساتھی اپنی باری کے روز حاضر خدمت ہوا ( جب واپس آیا ) تو اس نے میرا دروازہ بہت زور سے کھٹکھٹایا اور ( میرے بارے میں پوچھا کہ ) کیا عمر یہاں ہیں ؟ میں گھبرا کر اس کے پاس آیا ۔ وہ کہنے لگا کہ ایک بڑا معاملہ پیش آ گیا ہے ۔ ( یعنی رسول اللہ صلی اللہ علیہ وسلم نے اپنی بیویوں کو طلاق دے دی ہے ) پھر میں ( اپنی بیٹی ) حفصہ کے پاس گیا ، وہ رو رہی تھی ۔ میں نے پوچھا ، کیا تمہیں رسول اللہ صلی اللہ علیہ وسلم نے طلاق دے دی ہے ؟ وہ کہنے لگی میں نہیں جانتی ۔ پھر میں نبی کریم صلی اللہ علیہ وسلم کی خدمت میں حاضر ہوا ۔ میں نے کھڑے کھڑے کہا کہ کیا آپ ( صلی اللہ علیہ وسلم ) نے اپنی بیویوں کو طلاق دے دی ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں ۔ ( یہ افواہ غلط ہے ) تب میں نے ( تعجب سے ) کہا «الله اكبر» اللہ بہت بڑا ہے ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، انہیں شعیب نے زہری سے خبر دی ( ایک دوسری سند سے ) حضرت امام بخاری رحمہ اللہ کہتے ہیں کہ ابن وہب کو یونس نے ابن شہاب سے خبر دی ، وہ عبیداللہ بن عبداللہ ابن ابی ثور سے نقل کرتے ہیں ، وہ عبداللہ بن عباس رضی اللہ عنہما سے ، وہ حضرت عمر رضی اللہ عنہ سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، ح قَالَ أَبُو عَبْدِ اللَّهِ وَقَالَ ابْنُ وَهْبٍ أَخْبَرَنَا يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، عَنْ عُمَرَ، قَالَ كُنْتُ أَنَا وَجَارٌ، لِي مِنَ الأَنْصَارِ فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ، وَهْىَ مِنْ عَوَالِي الْمَدِينَةِ، وَكُنَّا نَتَنَاوَبُ النُّزُولَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا، فَإِذَا نَزَلْتُ جِئْتُهُ بِخَبَرِ ذَلِكَ الْيَوْمِ مِنَ الْوَحْىِ وَغَيْرِهِ، وَإِذَا نَزَلَ فَعَلَ مِثْلَ ذَلِكَ، فَنَزَلَ صَاحِبِي الأَنْصَارِيُّ يَوْمَ نَوْبَتِهِ، فَضَرَبَ بَابِي ضَرْبًا شَدِيدًا‏.‏ فَقَالَ أَثَمَّ هُوَ فَفَزِعْتُ فَخَرَجْتُ إِلَيْهِ فَقَالَ قَدْ حَدَثَ أَمْرٌ عَظِيمٌ‏.‏ قَالَ فَدَخَلْتُ عَلَى حَفْصَةَ فَإِذَا هِيَ تَبْكِي فَقُلْتُ طَلَّقَكُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ لاَ أَدْرِي‏.‏ ثُمَّ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقُلْتُ وَأَنَا قَائِمٌ أَطَلَّقْتَ نِسَاءَكَ قَالَ ‏ \"‏ لاَ ‏\"‏‏.‏ فَقُلْتُ اللَّهُ أَكْبَرُ‏.‏","headingArabic":"التَّنَاوُبِ فِي الْعِلْمِ","headingUrdu":"علم (دینی) سیکھنے کے لیے گردش میں فرائض کا تعین کرنا","headingEnglish":"To fix the duties in rotation for learning (religious) knowledge","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":90,"hadithNumber":"90","englishNarrator":"Narrated Abu Mas`ud Al-Ansari:","hadithEnglish":"Once a man said to Allah's Messenger (ﷺ) \"O Allah's Messenger (ﷺ)! I may not attend the (compulsory congregational) prayer because so and so (the Imam) prolongs the prayer when he leads us for it. The narrator added: \"I never saw the Prophet (ﷺ) more furious in giving advice than he was on that day. The Prophet said, \"O people! Some of you make others dislike good deeds (the prayers). So whoever leads the people in prayer should shorten it because among them there are the sick the weak and the needy (having some jobs to do).","hadithUrdu":"ایک شخص ( حزم بن ابی کعب ) نے ( رسول اللہ صلی اللہ علیہ وسلم کی خدمت میں آ کر ) عرض کیا ۔ یا رسول اللہ ! فلاں شخص ( معاذ بن جبل ) لمبی نماز پڑھاتے ہیں اس لیے میں ( جماعت کی ) نماز میں شریک نہیں ہو سکتا ( کیونکہ میں دن بھر اونٹ چرانے کی وجہ سے رات کو تھک کر چکنا چور ہو جاتا ہوں اور طویل قرآت سننے کی طاقت نہیں رکھتا ) ( ابومسعود راوی کہتے ہیں ) کہ اس دن سے زیادہ میں نے کبھی رسول اللہ صلی اللہ علیہ وسلم کو وعظ کے دوران اتنا غضب ناک نہیں دیکھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا اے لوگو ! تم ( ایسی شدت اختیار کر کے لوگوں کو دین سے ) نفرت دلانے لگے ہو ۔ ( سن لو ) جو شخص لوگوں کو نماز پڑھائے تو وہ ہلکی پڑھائے ، کیونکہ ان میں بیمار ، کمزور اور حاجت والے ( سب ہی قسم کے لوگ ) ہوتے ہیں ۔","urduNarrator":"ہم سے محمد بن کثیر نے بیان کیا انہیں سفیان نے ابوخالد سے خبر دی ، وہ قیس بن ابی حازم سے بیان کرتے ہیں ، وہ ابومسعود انصاری سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، قَالَ أَخْبَرَنَا سُفْيَانُ، عَنِ ابْنِ أَبِي خَالِدٍ، عَنْ قَيْسِ بْنِ أَبِي حَازِمٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ، لاَ أَكَادُ أُدْرِكُ الصَّلاَةَ مِمَّا يُطَوِّلُ بِنَا فُلاَنٌ، فَمَا رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم فِي مَوْعِظَةٍ أَشَدَّ غَضَبًا مِنْ يَوْمِئِذٍ فَقَالَ ‏ \"‏ أَيُّهَا النَّاسُ، إِنَّكُمْ مُنَفِّرُونَ، فَمَنْ صَلَّى بِالنَّاسِ فَلْيُخَفِّفْ، فَإِنَّ فِيهِمُ الْمَرِيضَ وَالضَّعِيفَ وَذَا الْحَاجَةِ ‏\"‏‏.‏","headingArabic":"الْغَضَبِ فِي الْمَوْعِظَةِ وَالتَّعْلِيمِ إِذَا رَأَى مَا يَكْرَهُ","headingUrdu":"تبلیغ یا تعلیم دیتے وقت غصہ کرنا اگر کوئی دیکھے کہ وہ کس چیز سے نفرت کرتا ہے۔","headingEnglish":"To be furious while preaching or teaching if one sees what one hates","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":91,"hadithNumber":"91","englishNarrator":"Narrated Zaid bin Khalid Al-Juhani:","hadithEnglish":"A man asked the Prophet (ﷺ) about the picking up of a \"Luqata\" (fallen lost thing). The Prophet (ﷺ) replied, \"Recognize and remember its tying material and its container, and make public announcement (about it) for one year, then utilize it but give it to its owner if he comes.\" Then the person asked about the lost camel. On that, the Prophet (ﷺ) got angry and his cheeks or his Face became red and he said, \"You have no concern with it as it has its water container, and its feet and it will reach water, and eat (the leaves) of trees till its owner finds it.\" The man then asked about the lost sheep. The Prophet (ﷺ) replied, \"It is either for you, for your brother (another person) or for the wolf.\"","hadithUrdu":"ایک شخص ( عمیر یا بلال ) نے رسول اللہ صلی اللہ علیہ وسلم سے پڑی ہوئی چیز کے بارے میں دریافت کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ، اس کی بندھن پہچان لے یا فرمایا کہ اس کا برتن اور تھیلی ( پہچان لے ) پھر ایک سال تک اس کی شناخت ( کا اعلان ) کراؤ پھر ( اس کا مالک نہ ملے تو ) اس سے فائدہ اٹھاؤ اور اگر اس کا مالک آ جائے تو اسے سونپ دو ۔ اس نے پوچھا کہ اچھا گم شدہ اونٹ ( کے بارے میں ) کیا حکم ہے ؟ آپ کو اس قدر غصہ آ گیا کہ رخسار مبارک سرخ ہو گئے ۔ یا راوی نے یہ کہا کہ آپ کا چہرہ سرخ ہو گیا ۔ ( یہ سن کر ) آپ صلی اللہ علیہ وسلم نے فرمایا ۔ تجھے اونٹ سے کیا واسطہ ؟ اس کے ساتھ خود اس کی مشک ہے اور اس کے ( پاؤں کے ) سم ہیں ۔ وہ خود پانی پر پہنچے گا اور خود پی لے گا اور خود درخت پر چرے گا ۔ لہٰذا اسے چھوڑ دو یہاں تک کہ اس کا مالک مل جائے ۔ اس نے کہا کہ اچھا گم شدہ بکری کے ( بارے میں ) کیا ارشاد ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، وہ تیری ہے یا تیرے بھائی کی ، ورنہ بھیڑئیے کی ( غذا ) ہے ۔","urduNarrator":"ہم سے عبداللہ بن محمد نے بیان کیا ، ان سے ابوعامر العقدی نے ، وہ سلیمان بن بلال المدینی سے ، وہ ربیعہ بن ابی عبدالرحمٰن سے ، وہ یزید سے جو منبعث کے آزاد کردہ تھے ، وہ زید بن خالد الجہنی سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا أَبُو عَامِرٍ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ الْمَدِينِيُّ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ يَزِيدَ، مَوْلَى الْمُنْبَعِثِ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سَأَلَهُ رَجُلٌ عَنِ اللُّقَطَةِ فَقَالَ ‏\"‏ اعْرِفْ وِكَاءَهَا ـ أَوْ قَالَ وِعَاءَهَا ـ وَعِفَاصَهَا، ثُمَّ عَرِّفْهَا سَنَةً، ثُمَّ اسْتَمْتِعْ بِهَا، فَإِنْ جَاءَ رَبُّهَا فَأَدِّهَا إِلَيْهِ ‏\"‏‏.‏ قَالَ فَضَالَّةُ الإِبِلِ فَغَضِبَ حَتَّى احْمَرَّتْ وَجْنَتَاهُ ـ أَوْ قَالَ احْمَرَّ وَجْهُهُ ـ فَقَالَ ‏\"‏ وَمَا لَكَ وَلَهَا مَعَهَا سِقَاؤُهَا وَحِذَاؤُهَا، تَرِدُ الْمَاءَ، وَتَرْعَى الشَّجَرَ، فَذَرْهَا حَتَّى يَلْقَاهَا رَبُّهَا ‏\"‏‏.‏ قَالَ فَضَالَّةُ الْغَنَمِ قَالَ ‏\"‏ لَكَ أَوْ لأَخِيكَ أَوْ لِلذِّئْبِ ‏\"‏‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":92,"hadithNumber":"92","englishNarrator":"Narrated Abu Musa:","hadithEnglish":"The Prophet (ﷺ) was asked about things which he did not like, but when the questioners insisted, the Prophet got angry. He then said to the people, \"Ask me anything you like.\" A man asked, \"Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhafa.\" Then another man got up and said, \"Who is my father, O Allah's Messenger (ﷺ) ?\" He replied, \"Your father is Salim, Maula (the freed slave) of Shaiba.\" So when `Umar saw that (the anger) on the face of the Prophet (ﷺ) he said, \"O Allah's Messenger (ﷺ)! We repent to Allah (Our offending you).","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم سے کچھ ایسی باتیں دریافت کی گئیں کہ آپ صلی اللہ علیہ وسلم کو برا معلوم ہوا اور جب ( اس قسم کے سوالات کی ) آپ صلی اللہ علیہ وسلم پر بہت زیادتی کی گئی تو آپ کو غصہ آ گیا ۔ پھر آپ صلی اللہ علیہ وسلم نے لوگوں سے فرمایا ( اچھا اب ) مجھ سے جو چاہو پوچھو ۔ تو ایک شخص نے دریافت کیا کہ میرا باپ کون ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ، تیرا باپ حذافہ ہے ۔ پھر دوسرا آدمی کھڑا ہوا اور اس نے پوچھا کہ یا رسول اللہ ! میرا باپ کون ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تیرا باپ سالم شبیہ کا آزاد کردہ غلام ہے ۔ آخر حضرت عمر رضی اللہ عنہ نے آپ کے چہرہ مبارک کا حال دیکھا تو عرض کیا یا رسول اللہ ! ہم ( ان باتوں کے دریافت کرنے سے جو آپ کو ناگوار ہوں ) اللہ سے توبہ کرتے ہیں ۔","urduNarrator":"ہم سے محمد بن علاء نے بیان کیا ، ان سے ابواسامہ نے برید کے واسطے سے بیان کیا ، وہ ابوبردہ سے اور وہ ابوموسیٰ سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ أَشْيَاءَ كَرِهَهَا، فَلَمَّا أُكْثِرَ عَلَيْهِ غَضِبَ، ثُمَّ قَالَ لِلنَّاسِ ‏\"‏ سَلُونِي عَمَّا شِئْتُمْ ‏\"‏‏.‏ قَالَ رَجُلٌ مَنْ أَبِي قَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ فَقَامَ آخَرُ فَقَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ فَقَالَ ‏\"‏ أَبُوكَ سَالِمٌ مَوْلَى شَيْبَةَ ‏\"‏‏.‏ فَلَمَّا رَأَى عُمَرُ مَا فِي وَجْهِهِ قَالَ يَا رَسُولَ اللَّهِ، إِنَّا نَتُوبُ إِلَى اللَّهِ عَزَّ وَجَلَّ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":93,"hadithNumber":"93","englishNarrator":"Narrated Anas bin Malik:","hadithEnglish":"One day Allah's Messenger (ﷺ) came out (before the people) and `Abdullah bin Hudhafa stood up and asked (him) \"Who is my father?\" The Prophet (ﷺ) replied, \"Your father is Hudhafa.\" The Prophet (ﷺ) told them repeatedly (in anger) to ask him anything they liked. `Umar knelt down before the Prophet (ﷺ) and said thrice, \"We accept Allah as (our) Lord and Islam as (our) religion and Muhammad as (our) Prophet.\" After that the Prophet (ﷺ) became silent.","hadithUrdu":"( ایک دن ) رسول اللہ صلی اللہ علیہ وسلم گھر سے نکلے تو عبداللہ بن حذافہ کھڑے ہو کر پوچھنے لگے کہ حضور میرا باپ کون ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا : حذافہ پھر آپ صلی اللہ علیہ وسلم نے باربار فرمایا کہ مجھ سے پوچھو ، تو حضرت عمر رضی اللہ عنہ نے دو زانو ہو کر عرض کیا کہ ہم اللہ کے رب ہونے پر ، اسلام کے دین ہونے ، اور محمد صلی اللہ علیہ وسلم کے نبی ہونے پر راضی ہیں ( اور یہ جملہ ) تین مرتبہ ( دہرایا ) پھر ( یہ سن کر ) رسول اللہ صلی اللہ علیہ وسلم خاموش ہو گئے ۔","urduNarrator":"ہم سے ابوالیمان نے بیان کیا ، انہیں شعیب نے زہری سے خبر دی ، انہیں انس بن مالک نے بتلایا کہ","hadithArabic":"حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ، فَقَامَ عَبْدُ اللَّهِ بْنُ حُذَافَةَ فَقَالَ مَنْ أَبِي فَقَالَ ‏\"‏ أَبُوكَ حُذَافَةُ ‏\"‏‏.‏ ثُمَّ أَكْثَرَ أَنْ يَقُولَ ‏\"‏ سَلُونِي ‏\"‏‏.‏ فَبَرَكَ عُمَرُ عَلَى رُكْبَتَيْهِ فَقَالَ رَضِينَا بِاللَّهِ رَبًّا، وَبِالإِسْلاَمِ دِينًا، وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيًّا، فَسَكَتَ‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":94,"hadithNumber":"94","englishNarrator":"Narrated Anas:","hadithEnglish":"Whenever the Prophet (ﷺ) asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).","hadithUrdu":"جب آپ صلی اللہ علیہ وسلم سلام کرتے تو تین بار سلام کرتے اور جب کوئی کلمہ ارشاد فرماتے تو اسے تین بار دہراتے یہاں تک کہ خوب سمجھ لیا جاتا ۔","urduNarrator":"ہم سے عبدہ نے بیان کیا ، ان سے عبدالصمد نے ، ان سے عبداللہ بن مثنی نے ، ان سے ثمامہ بن عبداللہ بن انس نے ، ان سے حضرت انس رضی اللہ عنہ نے بیان کیا ، وہ نبی اکرم صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدَةُ، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا سَلَّمَ سَلَّمَ ثَلاَثًا، وَإِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلاَثًا‏.‏","headingArabic":"مَنْ أَعَادَ الْحَدِيثَ ثَلاَثًا لِيُفْهَمَ عَنْهُ","headingUrdu":"دوسروں کو سمجھنے کے لیے تین بار بات کو دہرانا","headingEnglish":"Repeating ones talk thrice in order to make others understand","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":95,"hadithNumber":"95","englishNarrator":"Narrated Anas:","hadithEnglish":"Whenever the Prophet (ﷺ) spoke a sentence (said a thing), he used to repeat it thrice so that the people could understand it properly from him and whenever he asked permission to enter, (he knocked the door) thrice with greeting.","hadithUrdu":"جب آپ صلی اللہ علیہ وسلم کوئی کلمہ ارشاد فرماتے تو اسے تین بار لوٹاتے یہاں تک کہ خوب سمجھ لیا جاتا ۔ اور جب کچھ لوگوں کے پاس آپ صلی اللہ علیہ وسلم تشریف لاتے اور انہیں سلام کرتے تو تین بار سلام کرتے ۔","urduNarrator":"ہم سے عبدہ نے بیان کیا ، ان سے عبدالصمد نے ، ان سے عبداللہ بن مثنی نے ، ان سے ثمامہ بن عبداللہ بن انس نے ، انھوں نے حضرت انس بن مالک رضی اللہ عنہ سے بیان کیا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدَةُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ثُمَامَةُ بْنُ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ إِذَا تَكَلَّمَ بِكَلِمَةٍ أَعَادَهَا ثَلاَثًا حَتَّى تُفْهَمَ عَنْهُ، وَإِذَا أَتَى عَلَى قَوْمٍ فَسَلَّمَ عَلَيْهِمْ سَلَّمَ عَلَيْهِمْ ثَلاَثًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":96,"hadithNumber":"96","englishNarrator":"Narrated `Abdullah bin `Amr:","hadithEnglish":"Once Allah's Messenger (ﷺ) remained behind us in a journey. He joined us while we were performing ablution for the `Asr prayer which was over-due. We were just passing wet hands over our feet (not washing them properly) so the Prophet (ﷺ) addressed us in a loud voice and said twice or thrice, \"Save your heels from the fire.\"","hadithUrdu":"ایک سفر میں رسول اللہ صلی اللہ علیہ وسلم ہم سے پیچھے رہ گئے ۔ پھر آپ صلی اللہ علیہ وسلم ہمارے قریب پہنچے ۔ تو عصر کی نماز کا وقت ہو چکا تھا یا تنگ ہو گیا تھا اور ہم وضو کر رہے تھے ۔ ہم اپنے پیروں پر پانی کا ہاتھ پھیرنے لگے تو آپ صلی اللہ علیہ وسلم نے بلند آواز سے فرمایا کہ آگ کے عذاب سے ان ایڑیوں کی ( جو خشک رہ جائیں ) خرابی ہے ۔ یہ دو مرتبہ فرمایا یا تین مرتبہ ۔","urduNarrator":"ہم سے مسدد نے بیان کیا ، ان سے ابوعوانہ نے ابی بشر کے واسطے سے بیان کیا ، وہ یوسف بن ماھک سے بیان کرتے ہیں ، وہ عبداللہ بن عمرو رضی اللہ عنہما سے ، وہ کہتے ہیں کہ","hadithArabic":"حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ تَخَلَّفَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ سَافَرْنَاهُ فَأَدْرَكَنَا وَقَدْ أَرْهَقْنَا الصَّلاَةَ صَلاَةَ الْعَصْرِ وَنَحْنُ نَتَوَضَّأُ، فَجَعَلْنَا نَمْسَحُ عَلَى أَرْجُلِنَا، فَنَادَى بِأَعْلَى صَوْتِهِ ‏ \"‏ وَيْلٌ لِلأَعْقَابِ مِنَ النَّارِ ‏\"‏‏.‏ مَرَّتَيْنِ أَوْ ثَلاَثًا‏.‏","headingArabic":null,"headingUrdu":null,"headingEnglish":null,"chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":97,"hadithNumber":"97","englishNarrator":"Narrated Abu Burda's father:","hadithEnglish":"Allah's Messenger (ﷺ) said \"Three persons will have a double reward: \r\n1. A Person from the people of the scriptures who believed in his prophet (Jesus or Moses) and then believed in the Prophet (ﷺ) \r\nMuhammad (i .e. has embraced Islam). \r\n2. A slave who discharges his duties to Allah and his master. \r\n3. A master of a woman-slave who teaches her good manners and educates her in the best possible way (the religion) and \r\n manumits her and then marries her.\"","hadithUrdu":"رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تین شخص ہیں جن کے لیے دو گنا اجر ہے ۔ ایک وہ جو اہل کتاب سے ہو اور اپنے نبی پر اور محمد صلی اللہ علیہ وسلم پر ایمان لائے اور ( دوسرے ) وہ غلام جو اپنے آقا اور اللہ ( دونوں ) کا حق ادا کرے اور ( تیسرے ) وہ آدمی جس کے پاس کوئی لونڈی ہو ۔ جس سے شب باشی کرتا ہے اور اسے تربیت دے تو اچھی تربیت دے ، تعلیم دے تو عمدہ تعلیم دے ، پھر اسے آزاد کر کے اس سے نکاح کر لے ، تو اس کے لیے دو گنا اجر ہے ۔ پھر عامر نے ( صالح بن حیان سے ) کہا کہ ہم نے یہ حدیث تمہیں بغیر اجرت کے سنا دی ہے ( ورنہ ) اس سے کم حدیث کے لیے مدینہ تک کا سفر کیا جاتا تھا ۔","urduNarrator":"ہم سے محمد بن سلام نے بیان کیا ، انھوں نے کہا ہمیں محاربی نے خبر دی ، وہ صالح بن حیان سے بیان کرتے ہیں ، انھوں نے کہا کہ عامر شعبی نے بیان کیا ، کہا ان سے ابوبردہ نے اپنے باپ کے واسطے سے نقل کیا کہ","hadithArabic":"أَخْبَرَنَا مُحَمَّدٌ ـ هُوَ ابْنُ سَلاَمٍ ـ حَدَّثَنَا الْمُحَارِبِيُّ، قَالَ حَدَّثَنَا صَالِحُ بْنُ حَيَّانَ، قَالَ قَالَ عَامِرٌ الشَّعْبِيُّ حَدَّثَنِي أَبُو بُرْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ ثَلاَثَةٌ لَهُمْ أَجْرَانِ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ، وَآمَنَ بِمُحَمَّدٍ صلى الله عليه وسلم وَالْعَبْدُ الْمَمْلُوكُ إِذَا أَدَّى حَقَّ اللَّهِ وَحَقَّ مَوَالِيهِ، وَرَجُلٌ كَانَتْ عِنْدَهُ أَمَةٌ ‏{‏يَطَؤُهَا‏}‏ فَأَدَّبَهَا، فَأَحْسَنَ تَأْدِيبَهَا، وَعَلَّمَهَا فَأَحْسَنَ تَعْلِيمَهَا، ثُمَّ أَعْتَقَهَا فَتَزَوَّجَهَا، فَلَهُ أَجْرَانِ ‏\"‏‏.‏ ثُمَّ قَالَ عَامِرٌ أَعْطَيْنَاكَهَا بِغَيْرِ شَىْءٍ، قَدْ كَانَ يُرْكَبُ فِيمَا دُونَهَا إِلَى الْمَدِينَةِ‏.‏","headingArabic":"تَعْلِيمِ الرَّجُلِ أَمَتَهُ وَأَهْلَهُ","headingUrdu":"ایک آدمی اپنی لونڈی اور اپنے گھر والوں کو (دین) سکھاتا ہے۔","headingEnglish":"A man teaching (religion to) his woman-slave and his family","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":98,"hadithNumber":"98","englishNarrator":"Narrated Ibn 'Abbas:","hadithEnglish":"Once Allah's Messenger (ﷺ) came out while Bilal was accompanying him. He went towards the women thinking that they had not heard him (i.e. his sermon). So he preached them and ordered them to pay alms. (Hearing that) the women started giving alms; some donated their ear-rings, some gave their rings and Bilal was collecting them in the corner of his garment.","hadithUrdu":"میں رسول اللہ صلی اللہ علیہ وسلم پر گواہی دیتا ہوں ، یا عطاء نے کہا کہ میں ابن عباس پر گواہی دیتا ہوں کہ نبی کریم صلی اللہ علیہ وسلم ( ایک مرتبہ عید کے موقع پر مردوں کی صفوں میں سے ) نکلے اور آپ صلی اللہ علیہ وسلم کے ساتھ بلال رضی اللہ عنہ تھے ۔ آپ کو خیال ہوا کہ عورتوں کو ( خطبہ اچھی طرح ) نہیں سنائی دیا ۔ تو آپ صلی اللہ علیہ وسلم نے انہیں علیحدہ نصیحت فرمائی اور صدقے کا حکم دیا ( یہ وعظ سن کر ) کوئی عورت بالی ( اور کوئی عورت ) انگوٹھی ڈالنے لگی اور بلال رضی اللہ عنہ اپنے کپڑے کے دامن میں ( یہ چیزیں ) لینے لگے ۔ اس حدیث کو اسماعیل بن علیہ نے ایوب سے روایت کیا ، انھوں نے عطاء سے کہ ابن عباس رضی اللہ عنہما نے یوں کہا کہ میں آنحضرت صلی اللہ علیہ وسلم پر گواہی دیتا ہوں ( اس میں شک نہیں ہے ) امام بخاری کی غرض یہ ہے کہ اگلا باب عام لوگوں سے متعلق تھا اور یہ حاکم اور امام سے متعلق ہے کہ وہ بھی عورتوں کو وعظ سنائے ۔","urduNarrator":"ہم سے سلیمان بن حرب نے بیان کیا ، ان سے شعبہ نے ایوب کے واسطے سے بیان کیا ، انھوں نے عطاء بن ابی رباح سے سنا ، انھوں نے ابن عباس رضی اللہ عنہما سے سنا کہ","hadithArabic":"حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَيُّوبَ، قَالَ سَمِعْتُ عَطَاءً، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، قَالَ أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم ـ أَوْ قَالَ عَطَاءٌ أَشْهَدُ عَلَى ابْنِ عَبَّاسٍ ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ وَمَعَهُ بِلاَلٌ، فَظَنَّ أَنَّهُ لَمْ يُسْمِعِ النِّسَاءَ فَوَعَظَهُنَّ، وَأَمَرَهُنَّ بِالصَّدَقَةِ، فَجَعَلَتِ الْمَرْأَةُ تُلْقِي الْقُرْطَ وَالْخَاتَمَ، وَبِلاَلٌ يَأْخُذُ فِي طَرَفِ ثَوْبِهِ‏.‏ وَقَالَ إِسْمَاعِيلُ عَنْ أَيُّوبَ عَنْ عَطَاءٍ وَقَالَ عَنِ ابْنِ عَبَّاسٍ أَشْهَدُ عَلَى النَّبِيِّ صلى الله عليه وسلم‏.‏","headingArabic":"عِظَةِ الإِمَامِ النِّسَاءَ وَتَعْلِيمِهِنَّ","headingUrdu":"امام (چیف) کی طرف سے خواتین کو (مذہبی) علم کی تبلیغ (اور تعلیم)","headingEnglish":"The preaching (and teaching) of the (religious) knowledge to women by the Imam (Chief)","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":99,"hadithNumber":"99","englishNarrator":"Narrated Abu Huraira:","hadithEnglish":"I said: \"O Allah's Messenger (ﷺ)! Who will be the luckiest person, who will gain your intercession on the Day of Resurrection?\" Allah's Messenger (ﷺ) said: O Abu Huraira! \"I have thought that none will ask me about it before you as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said sincerely from the bottom of his heart \"None has the right to be worshipped but Allah.\"","hadithUrdu":"انھوں نے عرض کیا ، یا رسول اللہ ! قیامت کے دن آپ صلی اللہ علیہ وسلم کی شفاعت سے سب سے زیادہ سعادت کسے ملے گی ؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، اے ابوہریرہ رضی اللہ عنہ مجھے یقین تھا کہ تم سے پہلے کوئی اس کے بارے میں مجھ سے دریافت نہیں کرے گا ۔ کیونکہ میں نے حدیث کے متعلق تمہاری حرص دیکھ لی تھی ۔ سنو ! قیامت میں سب سے زیادہ فیض یاب میری شفاعت سے وہ شخص ہو گا ، جو سچے دل سے یا سچے جی سے «لا إله إلا الله» کہے گا ۔","urduNarrator":"ہم سے عبدالعزیز بن عبداللہ نے بیان کیا ، انھوں نے کہا مجھ سے سلیمان نے عمرو بن ابی عمرو کے واسطے سے بیان کیا ۔ وہ سعید بن ابی سعید المقبری کے واسطے سے بیان کرتے ہیں ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں کہ","hadithArabic":"حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي سُلَيْمَانُ، عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قِيلَ يَا رَسُولَ اللَّهِ، مَنْ أَسْعَدُ النَّاسِ بِشَفَاعَتِكَ يَوْمَ الْقِيَامَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لَقَدْ ظَنَنْتُ يَا أَبَا هُرَيْرَةَ أَنْ لاَ يَسْأَلَنِي عَنْ هَذَا الْحَدِيثِ أَحَدٌ أَوَّلُ مِنْكَ، لِمَا رَأَيْتُ مِنْ حِرْصِكَ عَلَى الْحَدِيثِ، أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، خَالِصًا مِنْ قَلْبِهِ أَوْ نَفْسِهِ ‏\"‏‏.‏","headingArabic":"الْحِرْصِ عَلَى الْحَدِيثِ","headingUrdu":"حدیث سیکھنے کا شوق","headingEnglish":"Eagerness to (learn) the Hadith","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}},{"id":100,"hadithNumber":"100","englishNarrator":"Narrated `Abdullah bin `Amr bin Al-`As:","hadithEnglish":"I heard Allah's Messenger (ﷺ) saying, \"Allah does not take away the knowledge, by taking it away from (the hearts of) the people, but takes it away by the death of the religious learned men till when none of the (religious learned men) remains, people will take as their leaders ignorant persons who when consulted will give their verdict without knowledge. So they will go astray and will lead the people astray.\"","hadithUrdu":"آپ صلی اللہ علیہ وسلم فرماتے تھے کہ اللہ علم کو اس طرح نہیں اٹھا لے گا کہ اس کو بندوں سے چھین لے ۔ بلکہ وہ ( پختہ کار ) علماء کو موت دے کر علم کو اٹھائے گا ۔ حتیٰ کہ جب کوئی عالم باقی نہیں رہے گا تو لوگ جاہلوں کو سردار بنا لیں گے ، ان سے سوالات کیے جائیں گے اور وہ بغیر علم کے جواب دیں گے ۔ اس لیے خود بھی گمراہ ہوں گے اور لوگوں کو بھی گمراہ کریں گے ۔ فربری نے کہا ہم سے عباس نے بیان کیا ، کہا ہم سے قتیبہ نے ، کہا ہم سے جریر نے ، انھوں نے ہشام سے مانند اس حدیث کے ۔","urduNarrator":"ہم سے اسماعیل بن ابی اویس نے بیان کیا ، ان سے مالک نے ہشام بن عروہ سے ، انھوں نے اپنے باپ سے نقل کیا ، انھوں نے عبداللہ بن عمرو بن العاص رضی اللہ عنہما سے نقل کیا کہ میں نے رسول اللہ صلی اللہ علیہ وسلم سے سنا","hadithArabic":"حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّ اللَّهَ لاَ يَقْبِضُ الْعِلْمَ انْتِزَاعًا، يَنْتَزِعُهُ مِنَ الْعِبَادِ، وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ، حَتَّى إِذَا لَمْ يُبْقِ عَالِمًا، اتَّخَذَ النَّاسُ رُءُوسًا جُهَّالاً فَسُئِلُوا، فَأَفْتَوْا بِغَيْرِ عِلْمٍ، فَضَلُّوا وَأَضَلُّوا ‏\"‏‏. قَالَ الْفِرَبْرِيُّ حَدَّثَنَا عَبَّاسٌ قَالَ حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا جَرِيرٌ عَنْ هِشَامٍ نَحْوَهُ‏.‏","headingArabic":"كَيْفَ يُقْبَضُ الْعِلْمُ","headingUrdu":"(دینی) علم کیسے چھین لیا جائے گا۔","headingEnglish":"How the (religious) knowledge will be taken away","chapterId":"3","bookSlug":"sahih-bukhari","volume":"1","status":"Sahih","book":{"id":1,"bookName":"Sahih Bukhari","writerName":"Imam Bukhari","aboutWriter":null,"writerDeath":"256 ھ","bookSlug":"sahih-bukhari"},"chapter":{"id":3,"chapterNumber":"3","chapterEnglish":"Knowledge","chapterUrdu":"علم کے بیان میں","chapterArabic":"كتاب العلم","bookSlug":"sahih-bukhari"}}],"first_page_url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=1","from":76,"last_page":1629,"last_page_url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=1629","links":[{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=3","label":"&laquo; Previous","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=1","label":"1","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=2","label":"2","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=3","label":"3","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=4","label":"4","active":true},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=5","label":"5","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=6","label":"6","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=7","label":"7","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=8","label":"8","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=9","label":"9","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=10","label":"10","active":false},{"url":null,"label":"...","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=1628","label":"1628","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=1629","label":"1629","active":false},{"url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=5","label":"Next &raquo;","active":false}],"next_page_url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=5","path":"https:\/\/www.hadithapi.com\/public\/api\/hadiths","per_page":25,"prev_page_url":"https:\/\/www.hadithapi.com\/public\/api\/hadiths?page=3","to":100,"total":40719}}