{
  "status": 200,
  "message": "Hadiths has been found.",
  "hadiths": {
    "current_page": 2,
    "data": [
      {
        "id": 26,
        "hadithNumber": "26",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "Allah's Messenger (ﷺ) was asked, \"What is the best deed?\" He replied, \"To believe in Allah and His Apostle (Muhammad). The questioner then asked, \"What is the next (in goodness)? He replied, \"To participate in Jihad (religious fighting) in Allah's Cause.\" The questioner again asked, \"What is the next (in goodness)?\" He replied, \"To perform Hajj (Pilgrim age to Mecca) 'Mubrur, (which is accepted by Allah and is performed with the intention of seeking Allah's pleasure only and not to show off and without committing a sin and in accordance with the traditions of the Prophet).\"",
        "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم سے دریافت کیا گیا کہ کون سا عمل سب سے افضل ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ” اللہ اور اس کے رسول پر ایمان لانا “ کہا گیا ، اس کے بعد کون سا ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ” اللہ کی راہ میں جہاد کرنا “ کہا گیا ، پھر کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا ” حج مبرور “ ۔",
        "urduNarrator": "ہم سے احمد بن یونس اور موسیٰ بن اسماعیل دونوں نے بیان کیا ، انھوں نے کہا ہم سے ابراہیم بن سعید نے بیان کیا ، انھوں نے کہا ہم سے ابن شہاب نے بیان کیا ، وہ سعید بن المسیب رضی اللہ عنہ سے روایت کرتے ہیں ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَمُوسَى بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا ابْنُ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ أَىُّ الْعَمَلِ أَفْضَلُ فَقَالَ ‏\"‏ إِيمَانٌ بِاللَّهِ وَرَسُولِهِ ‏\"‏‏.‏ قِيلَ ثُمَّ مَاذَا قَالَ ‏\"‏ الْجِهَادُ فِي سَبِيلِ اللَّهِ ‏\"‏‏.‏ قِيلَ ثُمَّ مَاذَا قَالَ ‏\"‏ حَجٌّ مَبْرُورٌ ‏\"‏‏.‏",
        "headingArabic": "مَنْ قَالَ إِنَّ الإِيمَانَ هُوَ الْعَمَلُ",
        "headingUrdu": "جو کہتا ہے کہ ایمان عمل ہے (نیک عمل)",
        "headingEnglish": "Whoever says that faith is action (good deeds)",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 27,
        "hadithNumber": "27",
        "englishNarrator": "Narrated Sa'd:",
        "hadithEnglish": "Allah's Messenger (ﷺ) distributed (Zakat) amongst (a group of) people while I was sitting there but Allah's Messenger (ﷺ) left a man whom I thought the best of the lot. I asked, \"O Allah's Messenger (ﷺ)! Why have you left that person? By Allah I regard him as a faithful believer.\" The Prophet (ﷺ) commented: \"Or merely a Muslim.\" I remained quiet for a while, but could not help repeating my question because of what I knew about him. And then asked Allah's Messenger (ﷺ), \"Why have you left so and so? By Allah! He is a faithful believer.\" The Prophet (ﷺ) again said, \"Or merely a Muslim.\" And I could not help repeating my question because of what I knew about him. Then the Prophet (ﷺ) said, \"O Sa'd! I give to a person while another is dearer to me, for fear that he might be thrown on his face in the Fire by Allah.\"",
        "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے چند لوگوں کو کچھ عطیہ دیا اور سعد وہاں موجود تھے ۔ ( وہ کہتے ہیں کہ ) رسول اللہ صلی اللہ علیہ وسلم نے ان میں سے ایک شخص کو کچھ نہ دیا ۔ حالانکہ وہ ان میں مجھے سب سے زیادہ پسند تھا ۔ میں نے کہا حضور آپ نے فلاں کو کچھ نہ دیا حالانکہ میں اسے مومن گمان کرتا ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا مومن یا مسلمان ؟ میں تھوڑی دیر چپ رہ کر پھر پہلی بات دہرانے لگا ۔ حضور صلی اللہ علیہ وسلم نے بھی دوبارہ وہی جواب دیا ۔ پھر آپ صلی اللہ علیہ وسلم نے فرمایا کہ اے سعد ! باوجود یہ کہ ایک شخص مجھے زیادہ عزیز ہے ( پھر بھی میں اسے نظرانداز کر کے ) کسی اور دوسرے کو اس خوف کی وجہ سے یہ مال دے دیتا ہوں کہ ( وہ اپنی کمزوری کی وجہ سے اسلام سے پھر جائے اور ) اللہ اسے آگ میں اوندھا ڈال دے ۔ اس حدیث کو یونس ، صالح ، معمر اور زہری کے بھتیجے عبداللہ نے زہری سے روایت کیا ۔",
        "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، وہ کہتے ہیں کہ ہمیں شعیب نے زہری سے خبر دی ، انہیں عامر بن سعد بن ابی وقاص نے اپنے والد سعد رضی اللہ عنہ سے سن کر یہ خبر دی کہ",
        "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عَامِرُ بْنُ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ سَعْدٍ، رضى الله عنه أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَعْطَى رَهْطًا وَسَعْدٌ جَالِسٌ، فَتَرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً هُوَ أَعْجَبُهُمْ إِلَىَّ فَقُلْتُ يَا رَسُولَ اللَّهِ مَا لَكَ عَنْ فُلاَنٍ فَوَاللَّهِ إِنِّي لأَرَاهُ مُؤْمِنًا‏.‏ فَقَالَ ‏\"‏ أَوْ مُسْلِمًا ‏\"‏‏.‏ فَسَكَتُّ قَلِيلاً، ثُمَّ غَلَبَنِي مَا أَعْلَمُ مِنْهُ فَعُدْتُ لِمَقَالَتِي فَقُلْتُ مَا لَكَ عَنْ فُلاَنٍ فَوَاللَّهِ إِنِّي لأَرَاهُ مُؤْمِنًا فَقَالَ ‏\"‏ أَوْ مُسْلِمًا ‏\"‏‏.‏ ثُمَّ غَلَبَنِي مَا أَعْلَمُ مِنْهُ فَعُدْتُ لِمَقَالَتِي وَعَادَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏\"‏ يَا سَعْدُ، إِنِّي لأُعْطِي الرَّجُلَ وَغَيْرُهُ أَحَبُّ إِلَىَّ مِنْهُ، خَشْيَةَ أَنْ يَكُبَّهُ اللَّهُ فِي النَّارِ ‏\"‏‏.‏ وَرَوَاهُ يُونُسُ وَصَالِحٌ وَمَعْمَرٌ وَابْنُ أَخِي الزُّهْرِيِّ عَنِ الزُّهْرِيِّ‏.‏",
        "headingArabic": "إِذَا لَمْ يَكُنِ الإِسْلاَمُ عَلَى الْحَقِيقَةِ وَكَانَ عَلَى الاِسْتِسْلاَمِ أَوِ الْخَوْفِ مِنَ الْقَتْلِ",
        "headingUrdu": "اگر کوئی شخص صحیح معنوں میں اسلام قبول نہیں کرتا لیکن مجبوری یا قتل کے خوف سے ایسا کرتا ہے (تو وہ شخص مومن نہیں ہے)",
        "headingEnglish": "If one does not embrace Islam truly but does so by compulsion or for fear of being killed (then that man is not a believer)",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 28,
        "hadithNumber": "28",
        "englishNarrator": "Narrated 'Abdullah bin 'Amr:",
        "hadithEnglish": "A person asked Allah's Messenger (ﷺ) . \"What (sort of) deeds in or (what qualities of) Islam are good?\" He replied, \"To feed (the poor) and greet those whom you know and those whom you don't know.\"",
        "hadithUrdu": "ایک آدمی نے رسول اللہ صلی اللہ علیہ وسلم سے پوچھا کون سا اسلام بہتر ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ تو کھانا کھلائے اور ہر شخص کو سلام کرے خواہ اس کو تو جانتا ہو یا نہ جانتا ہو ۔",
        "urduNarrator": "ہم سے قتیبہ نے بیان کیا ، انھوں نے کہا ہم سے لیث نے بیان کیا ، انھوں نے یزید بن ابی حبیب سے ، انھوں نے ابوالخیر سے ، انھوں نے عبداللہ بن عمرو رضی اللہ عنہما سے کہ",
        "hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَىُّ الإِسْلاَمِ خَيْرٌ قَالَ ‏ \"‏ تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ ‏\"‏‏.‏",
        "headingArabic": "إِفْشَاءُ السَّلاَمِ مِنَ الإِسْلاَمِ",
        "headingUrdu": "سلام کرنا اسلام کا حصہ ہے۔",
        "headingEnglish": "To greet is a part of Islam",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 29,
        "hadithNumber": "29",
        "englishNarrator": "Narrated Ibn 'Abbas:",
        "hadithEnglish": "The Prophet (ﷺ) said: \"I was shown the Hell-fire and that the majority of its dwellers were women who were ungrateful.\" It was asked, \"Do they disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied, \"They are ungrateful to their husbands and are ungrateful for the favors and the good (charitable deeds) done to them. If you have always been good (benevolent) to one of them and then she sees something in you (not of her liking), she will say, 'I have never received any good from you.\"",
        "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا مجھے دوزخ دکھلائی گئی تو اس میں زیادہ تر عورتیں تھیں جو کفر کرتی ہیں ۔ کہا گیا حضور کیا وہ اللہ کے ساتھ کفر کرتی ہیں ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ خاوند کی ناشکری کرتی ہیں ۔ اور احسان کی ناشکری کرتی ہیں ۔ اگر تم عمر بھر ان میں سے کسی کے ساتھ احسان کرتے رہو ۔ پھر تمہاری طرف سے کبھی کوئی ان کے خیال میں ناگواری کی بات ہو جائے تو فوراً کہہ اٹھے گی کہ میں نے کبھی بھی تجھ سے کوئی بھلائی نہیں دیکھی ۔",
        "urduNarrator": "اس حدیث کو ہم سے عبداللہ بن مسلمہ نے بیان کیا ، وہ امام مالک سے ، وہ زید بن اسلم سے ، وہ عطاء بن یسار سے ، وہ حضرت عبداللہ ابن عباس رضی اللہ عنہما سے نقل کرتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، عَنْ مَالِكٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ أُرِيتُ النَّارَ فَإِذَا أَكْثَرُ أَهْلِهَا النِّسَاءُ يَكْفُرْنَ ‏\"‏‏.‏ قِيلَ أَيَكْفُرْنَ بِاللَّهِ قَالَ ‏\"‏ يَكْفُرْنَ الْعَشِيرَ، وَيَكْفُرْنَ الإِحْسَانَ، لَوْ أَحْسَنْتَ إِلَى إِحْدَاهُنَّ الدَّهْرَ ثُمَّ رَأَتْ مِنْكَ شَيْئًا قَالَتْ مَا رَأَيْتُ مِنْكَ خَيْرًا قَطُّ ‏\"‏‏.‏",
        "headingArabic": "كُفْرَانِ الْعَشِيرِ وَكُفْرٍ دُونَ كُفْرٍ",
        "headingUrdu": "شوہر کی ناشکری کرنا۔ اور کفر (مختلف درجات) کم (یا زیادہ) درجوں کا ہے۔",
        "headingEnglish": "To be ungrateful to one's husband. And disbelief is of (different grades) lesser (or greater) degrees.",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 30,
        "hadithNumber": "30",
        "englishNarrator": "Narrated Al-Ma'rur:",
        "hadithEnglish": "At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave, too, was wearing a similar one. I asked about the reason for it. He replied, \"I abused a person by calling his mother with bad names.\" The Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his mother with bad names You still have some characteristics of ignorance. Your slaves are your brothers and Allah has put them under your command. So whoever has a brother under his command should feed him of what he eats and dress him of what he wears. Do not ask them (slaves) to do things beyond their capacity (power) and if you do so, then help them.' \"",
        "hadithUrdu": "میں ابوذر سے ربذہ میں ملا وہ ایک جوڑا پہنے ہوئے تھے اور ان کا غلام بھی جوڑا پہنے ہوئے تھا ۔ میں نے اس کا سبب دریافت کیا تو کہنے لگے کہ میں نے ایک شخص یعنی غلام کو برا بھلا کہا تھا اور اس کی ماں کی غیرت دلائی ( یعنی گالی دی ) تو رسول اللہ صلی اللہ علیہ وسلم نے یہ معلوم کر کے مجھ سے فرمایا اے ابوذر ! تو نے اسے ماں کے نام سے غیرت دلائی ، بیشک تجھ میں ابھی کچھ زمانہ جاہلیت کا اثر باقی ہے ۔ ( یاد رکھو ) ماتحت لوگ تمہارے بھائی ہیں ۔ اللہ نے ( اپنی کسی مصلحت کی بنا پر ) انہیں تمہارے قبضے میں دے رکھا ہے تو جس کے ماتحت اس کا کوئی بھائی ہو تو اس کو بھی وہی کھلائے جو آپ کھاتا ہے اور وہی کپڑا اسے پہنائے جو آپ پہنتا ہے اور ان کو اتنے کام کی تکلیف نہ دو کہ ان کے لیے مشکل ہو جائے اور اگر کوئی سخت کام ڈالو تو تم خود بھی ان کی مدد کرو ۔",
        "urduNarrator": "ہم سے سلیمان بن حرب نے بیان کیا ، کہا ہم سے شعبہ نے بیان کیا ، انھوں نے اسے واصل احدب سے ، انھوں نے معرور سے ، کہا",
        "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ وَاصِلٍ الأَحْدَبِ، عَنِ الْمَعْرُورِ، قَالَ لَقِيتُ أَبَا ذَرٍّ بِالرَّبَذَةِ، وَعَلَيْهِ حُلَّةٌ، وَعَلَى غُلاَمِهِ حُلَّةٌ، فَسَأَلْتُهُ عَنْ ذَلِكَ، فَقَالَ إِنِّي سَابَبْتُ رَجُلاً، فَعَيَّرْتُهُ بِأُمِّهِ، فَقَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم ‏ \"‏ يَا أَبَا ذَرٍّ أَعَيَّرْتَهُ بِأُمِّهِ إِنَّكَ امْرُؤٌ فِيكَ جَاهِلِيَّةٌ، إِخْوَانُكُمْ خَوَلُكُمْ، جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ، فَمَنْ كَانَ أَخُوهُ تَحْتَ يَدِهِ فَلْيُطْعِمْهُ مِمَّا يَأْكُلُ، وَلْيُلْبِسْهُ مِمَّا يَلْبَسُ، وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ، فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ ‏\"‏‏.‏",
        "headingArabic": "الْمَعَاصِي مِنْ أَمْرِ الْجَاهِلِيَّةِ",
        "headingUrdu": "گناہ جاہلیت سے ہوتے ہیں اور گنہگار اس وقت تک کافر نہیں ہوتا جب تک کہ اللہ عزوجل کے ساتھ دوسروں کی عبادت نہ کرے۔",
        "headingEnglish": "Sins are from ignorance and a sinner is not a disbeliever unless he worships others along with Allah 'Azza wa Jall",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 31,
        "hadithNumber": "31",
        "englishNarrator": "Narrated Al-Ahnaf bin Qais:",
        "hadithEnglish": "While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met me and asked, \"Where are you going?\" I replied, \"I am going to help that person.\" He said, \"Go back for I have heard Allah's Messenger (ﷺ) saying, 'When two Muslims fight (meet) each other with their swords, both the murderer as well as the murdered will go to the Hell-fire.' I said, 'O Allah's Messenger (ﷺ)! It is all right for the murderer but what about the murdered one?' Allah's Messenger (ﷺ) replied, \"He surely had the intention to kill his companion.\"",
        "hadithUrdu": "میں اس شخص ( حضرت علی رضی اللہ عنہ ) کی مدد کرنے کو چلا ۔ راستے میں مجھ کو ابوبکرہ ملے ۔ پوچھا کہاں جاتے ہو ؟ میں نے کہا ، اس شخص ( حضرت علی رضی اللہ عنہ ) کی مدد کرنے کو جاتا ہوں ۔ ابوبکرہ نے کہا اپنے گھر کو لوٹ جاؤ ۔ میں نے آنحضرت صلی اللہ علیہ وسلم سے سنا ہے آپ صلی اللہ علیہ وسلم فرماتے تھے جب دو مسلمان اپنی اپنی تلواریں لے کر بھڑ جائیں تو قاتل اور مقتول دونوں دوزخی ہیں ۔ میں نے عرض کیا یا رسول اللہ ! قاتل تو خیر ( ضرور دوزخی ہونا چاہیے ) مقتول کیوں ؟ فرمایا ’’ وہ بھی اپنے ساتھی کو مار ڈالنے کی حرص رکھتا تھا ۔ ‘‘ ( موقع پاتا تو وہ اسے ضرور قتل کر دیتا دل کے عزم صمیم پر وہ دوزخی ہوا ) ۔",
        "urduNarrator": "ہم سے بیان کیا عبدالرحمٰن بن مبارک نے ، کہا ہم سے بیان کیا حماد بن زید نے ، کہا ہم سے بیان کیا ایوب اور یونس نے ، انھوں نے حسن سے ، انھوں نے احنف بن قیس سے ، کہا کہ",
        "hadithArabic": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الْمُبَارَكِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا أَيُّوبُ، وَيُونُسُ، عَنِ الْحَسَنِ، عَنِ الأَحْنَفِ بْنِ قَيْسٍ، قَالَ ذَهَبْتُ لأَنْصُرَ هَذَا الرَّجُلَ، فَلَقِيَنِي أَبُو بَكْرَةَ فَقَالَ أَيْنَ تُرِيدُ قُلْتُ أَنْصُرُ هَذَا الرَّجُلَ‏.‏ قَالَ ارْجِعْ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏\"‏ إِذَا الْتَقَى الْمُسْلِمَانِ بِسَيْفَيْهِمَا فَالْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ ‏\"‏‏.‏ فَقُلْتُ يَا رَسُولَ اللَّهِ هَذَا الْقَاتِلُ فَمَا بَالُ الْمَقْتُولِ قَالَ ‏\"‏ إِنَّهُ كَانَ حَرِيصًا عَلَى قَتْلِ صَاحِبِهِ ‏\"‏‏.‏",
        "headingArabic": "{وَإِنْ طَائِفَتَانِ مِنَ الْمُؤْمِنِينَ اقْتَتَلُوا فَأَصْلِحُوا بَيْنَهُمَا} فَسَمَّاهُمُ الْمُؤْمِنِينَ",
        "headingUrdu": "’’اور اگر مومنوں میں سے دو گروہ (یا گروہ) آپس میں لڑ پڑیں تو ان دونوں کے درمیان صلح کرا دو۔‘‘ اللہ تعالیٰ نے انہیں ’’مومن‘‘ کہا ہے۔",
        "headingEnglish": "\"And if two parties (or groups) from among the believers fall to fighting, then make peace between them both…\" Allah has called them \"believers\"",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 32,
        "hadithNumber": "32",
        "englishNarrator": "Narrated 'Abdullah:",
        "hadithEnglish": "When the following Verse was revealed: \"It is those who believe and confuse not their belief with wrong (worshipping others besides Allah.)\" (6:83), the companions of Allah's Messenger (ﷺ) asked, \"Who is amongst us who had not done injustice (wrong)?\" Allah revealed: \"No doubt, joining others in worship with Allah is a great injustice (wrong) indeed.\" (31.13)",
        "hadithUrdu": "جب سورۃ الانعام کی یہ آیت اتری جو لوگ ایمان لائے اور انھوں نے اپنے ایمان میں گناہوں کی آمیزش نہیں کی تو آپ صلی اللہ علیہ وسلم کے اصحاب نے کہا یا رسول اللہ ! یہ تو بہت ہی مشکل ہے ۔ ہم میں کون ایسا ہے جس نے گناہ نہیں کیا ۔ تب اللہ پاک نے سورۃ لقمان کی یہ آیت اتاری «إن الشرك لظلم عظيم‏» کہ بیشک شرک بڑا ظلم ہے ۔",
        "urduNarrator": "ہمارے سامنے ابوالولید نے بیان کیا ، انھوں نے کہا ہم سے شعبہ نے بیان کیا ( دوسری سند ) اور امام بخاری رحمہ اللہ نے کہا کہ ہم سے ( اسی حدیث کو ) بشر نے بیان کیا ، ان سے محمد نے ، ان سے شعبہ نے ، انھوں نے سلیمان سے ، انھوں نے علقمہ سے ، انھوں نے عبداللہ بن مسعود رضی اللہ عنہما سے",
        "hadithArabic": "حَدَّثَنَا أَبُو الْوَلِيدِ، قَالَ حَدَّثَنَا شُعْبَةُ، ح‏.‏ قَالَ وَحَدَّثَنِي بِشْرٌ، قَالَ حَدَّثَنَا مُحَمَّدٌ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا نَزَلَتِ ‏{‏الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ‏}‏ قَالَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَيُّنَا لَمْ يَظْلِمْ فَأَنْزَلَ اللَّهُ ‏{‏إِنَّ الشِّرْكَ لَظُلْمٌ عَظِيمٌ‏}‏‏.‏",
        "headingArabic": "ظُلْمٌ دُونَ ظُلْمٍ",
        "headingUrdu": "ایک قسم کی غلط (غلط) دوسری قسم سے زیادہ یا کم ہوسکتی ہے۔",
        "headingEnglish": "Dhulm (wrong) of one kind can be greater or lesser than that of another",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 33,
        "hadithNumber": "33",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "The Prophet (ﷺ) said, \"The signs of a hypocrite are three: \r\n1. Whenever he speaks, he tells a lie. \r\n2. Whenever he promises, he always breaks it (his promise ). \r\n3. If you trust him, he proves to be dishonest. (If you keep something as a trust with him, he will not return it.)\"",
        "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا ، منافق کی علامتیں تین ہیں ۔ جب بات کرے جھوٹ بولے ، جب وعدہ کرے اس کے خلاف کرے اور جب اس کو امین بنایا جائے تو خیانت کرے ۔",
        "urduNarrator": "ہم سے سلیمان ابوالربیع نے بیان کیا ، ان سے اسماعیل بن جعفر نے ، ان سے نافع بن ابی عامر ابوسہیل نے ، وہ اپنے باپ سے ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے روایت کرتے ہیں ، وہ رسول اللہ صلی اللہ علیہ وسلم سے نقل کرتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا سُلَيْمَانُ أَبُو الرَّبِيعِ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنَا نَافِعُ بْنُ مَالِكِ بْنِ أَبِي عَامِرٍ أَبُو سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ آيَةُ الْمُنَافِقِ ثَلاَثٌ إِذَا حَدَّثَ كَذَبَ، وَإِذَا وَعَدَ أَخْلَفَ، وَإِذَا اؤْتُمِنَ خَانَ ‏\"‏‏.‏",
        "headingArabic": "عَلاَمَةِ الْمُنَافِقِ",
        "headingUrdu": "منافق کی نشانیاں",
        "headingEnglish": "The signs of a hypocrite",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 34,
        "hadithNumber": "34",
        "englishNarrator": "Narrated 'Abdullah bin 'Amr:",
        "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever has the following four (characteristics) will be a pure hypocrite and whoever has one of the following four characteristics will have one characteristic of hypocrisy unless and until he gives it up.\r\n1. Whenever he is entrusted, he betrays. \r\n2. Whenever he speaks, he tells a lie. \r\n3. Whenever he makes a covenant, he proves treacherous. \r\n4. Whenever he quarrels, he behaves in a very imprudent, evil and insulting manner.\"",
        "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ چار عادتیں جس کسی میں ہوں تو وہ خالص منافق ہے اور جس کسی میں ان چاروں میں سے ایک عادت ہو تو وہ ( بھی ) نفاق ہی ہے ، جب تک اسے نہ چھوڑ دے ۔ ( وہ یہ ہیں ) جب اسے امین بنایا جائے تو ( امانت میں ) خیانت کرے اور بات کرتے وقت جھوٹ بولے اور جب ( کسی سے ) عہد کرے تو اسے پورا نہ کرے اور جب ( کسی سے ) لڑے تو گالیوں پر اتر آئے ۔ اس حدیث کو شعبہ نے ( بھی ) سفیان کے ساتھ اعمش سے روایت کیا ہے ۔",
        "urduNarrator": "ہم سے قبیصہ بن عقبہ نے یہ حدیث بیان کی ، ان سے سفیان نے ، وہ اعمش بن عبیداللہ بن مرہ سے نقل کرتے ہیں ، وہ مسروق سے ، وہ عبداللہ بن عمر رضی اللہ عنہما سے روایت کرتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا قَبِيصَةُ بْنُ عُقْبَةَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا، وَمَنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ حَتَّى يَدَعَهَا إِذَا اؤْتُمِنَ خَانَ وَإِذَا حَدَّثَ كَذَبَ وَإِذَا عَاهَدَ غَدَرَ، وَإِذَا خَاصَمَ فَجَرَ ‏\"‏‏.‏ تَابَعَهُ شُعْبَةُ عَنِ الأَعْمَشِ‏.‏",
        "headingArabic": null,
        "headingUrdu": null,
        "headingEnglish": null,
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 35,
        "hadithNumber": "35",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever establishes the prayers on the night of Qadr out of sincere faith and hoping to attain Allah's rewards (not to show off) then all his past sins will be forgiven.\"",
        "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ، جو شخص شب قدر ایمان کے ساتھ محض ثواب آخرت کے لیے ذکر و عبادت میں گزارے ، اس کے گزشتہ گناہ بخش دئیے جاتے ہیں ۔",
        "urduNarrator": "ہم سے ابوالیمان نے بیان کیا ، انہیں شعیب نے خبر دی ، کہا ان سے ابوالزناد نے اعرج کے واسطے سے بیان کیا ، اعرج نے حضرت ابوہریرہ رضی اللہ عنہ سے نقل کیا ، وہ کہتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا أَبُو الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ يَقُمْ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
        "headingArabic": "قِيَامُ لَيْلَةِ الْقَدْرِ مِنَ الإِيمَانِ",
        "headingUrdu": "شب قدر میں (نفل) نمازیں قائم کرنا ایمان کا حصہ ہے۔",
        "headingEnglish": "To establish the (Nawafil - voluntary) prayers on the night of Qadr is a part of faith",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 36,
        "hadithNumber": "36",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "The Prophet (ﷺ) said, \"The person who participates in (Holy battles) in Allah's cause and nothing compels him to do so except belief in Allah and His Apostles, will be recompensed by Allah either with a reward, or booty (if he survives) or will be admitted to Paradise (if he is killed in the battle as a martyr). Had I not found it difficult for my followers, then I would not remain behind any sariya going for Jihad and I would have loved to be martyred in Allah's cause and then made alive, and then martyred and then made alive, and then again martyred in His cause.\"",
        "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص اللہ کی راہ میں ( جہاد کے لیے ) نکلا ، اللہ اس کا ضامن ہو گیا ۔ ( اللہ تعالیٰ فرماتا ہے ) اس کو میری ذات پر یقین اور میرے پیغمبروں کی تصدیق نے ( اس سرفروشی کے لیے گھر سے ) نکالا ہے ۔ ( میں اس بات کا ضامن ہوں ) کہ یا تو اس کو واپس کر دوں ثواب اور مال غنیمت کے ساتھ ، یا ( شہید ہونے کے بعد ) جنت میں داخل کر دوں ( رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ) اور اگر میں اپنی امت پر ( اس کام کو ) دشوار نہ سمجھتا تو لشکر کا ساتھ نہ چھوڑتا اور میری خواہش ہے کہ اللہ کی راہ میں مارا جاؤں ، پھر زندہ کیا جاؤں ، پھر مارا جاؤں ، پھر زندہ کیا جاؤں ، پھر مارا جاؤں ۔",
        "urduNarrator": "ہم سے حرمی بن حفص نے بیان کیا ، ان سے عبدالواحد نے ، ان سے عمارہ نے ، ان سے ابوزرعہ بن عمرو بن جریر نے ، وہ کہتے ہیں میں نے حضرت ابوہریرہ سے سنا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے نقل کرتے ہیں",
        "hadithArabic": "حَدَّثَنَا حَرَمِيُّ بْنُ حَفْصٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَاحِدِ، قَالَ حَدَّثَنَا عُمَارَةُ، قَالَ حَدَّثَنَا أَبُو زُرْعَةَ بْنُ عَمْرِو بْنِ جَرِيرٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ انْتَدَبَ اللَّهُ لِمَنْ خَرَجَ فِي سَبِيلِهِ لاَ يُخْرِجُهُ إِلاَّ إِيمَانٌ بِي وَتَصْدِيقٌ بِرُسُلِي أَنْ أُرْجِعَهُ بِمَا نَالَ مِنْ أَجْرٍ أَوْ غَنِيمَةٍ، أَوْ أُدْخِلَهُ الْجَنَّةَ، وَلَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي مَا قَعَدْتُ خَلْفَ سَرِيَّةٍ، وَلَوَدِدْتُ أَنِّي أُقْتَلُ فِي سَبِيلِ اللَّهِ ثُمَّ أُحْيَا، ثُمَّ أُقْتَلُ ثُمَّ أُحْيَا، ثُمَّ أُقْتَلُ ‏\"‏‏.‏",
        "headingArabic": "الْجِهَادُ مِنَ الإِيمَانِ",
        "headingUrdu": "الجہاد (اللہ کی راہ میں لڑنا) ایمان کا حصہ ہے۔",
        "headingEnglish": "Al-Jihad (fighting tn Allah's Cause) is a part of faith",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 37,
        "hadithNumber": "37",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "Allah's Messenger (ﷺ) said: \"Whoever establishes prayers during the nights of Ramadan faithfully out of sincere faith and hoping to attain Allah's rewards (not for showing off), all his past sins will be forgiven.\"",
        "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا جو کوئی رمضان میں ( راتوں کو ) ایمان رکھ کر اور ثواب کے لیے عبادت کرے اس کے اگلے گناہ بخش دئیے جاتے ہیں ۔",
        "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، انھوں نے کہا کہ مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، انھوں نے ابن شہاب سے نقل کیا ، انھوں نے حمید بن عبدالرحمٰن سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
        "headingArabic": "تَطَوُّعُ قِيَامِ رَمَضَانَ مِنَ الإِيمَانِ",
        "headingUrdu": "رمضان المبارک کی راتوں میں (نوافل - نفلی) نمازیں قائم کرنا ایمان کا حصہ ہے۔",
        "headingEnglish": "It is a part of faith to establish the (Nawafil — voluntary) prayers during the nights of Ramadan",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 38,
        "hadithNumber": "38",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "Allah's Messenger (ﷺ) said, \"Whoever observes fasts during the month of Ramadan out of sincere faith, and hoping to attain Allah's rewards, then all his past sins will be forgiven.\"",
        "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا جس نے رمضان کے روزے ایمان اور خالص نیت کے ساتھ رکھے اس کے پچھلے گناہ بخش دیئے گئے ۔",
        "urduNarrator": "ہم نے ابن سلام نے بیان کیا ، انھوں نے کہا کہ ہمیں محمد بن فضیل نے خبر دی ، انھوں نے کہا کہ ہم سے یحییٰ بن سعید نے بیان کیا ، انھوں نے ابوسلمہ سے روایت کی ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے نقل کرتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا ابْنُ سَلاَمٍ، قَالَ أَخْبَرَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ‏\"‏‏.‏",
        "headingArabic": "صَوْمُ رَمَضَانَ احْتِسَابًا مِنَ الإِيمَانِ",
        "headingUrdu": "رمضان کے مہینے میں (خلوص اور ایمانداری سے) صرف اللہ سے اجر کی امید رکھتے ہوئے (اسلامی تعلیمات کے مطابق) روزے رکھنا، ایمان کا حصہ ہے۔",
        "headingEnglish": "To observe fasting (according to Islamic teachings)] during the month of Ramadan (sincerely and faithfully) hoping for Allah's Reward only, is a part of faith",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 39,
        "hadithNumber": "39",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "The Prophet (ﷺ) said, \"Religion is very easy and whoever overburdens himself in his religion will not be able to continue in that way. So you should not be extremists, but try to be near to perfection and receive the good tidings that you will be rewarded; and gain strength by worshipping in the mornings, the afternoons, and during the last hours of the nights.\" (See Fath-ul-Bari, Page 102, Vol 1).",
        "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا بیشک دین آسان ہے اور جو شخص دین میں سختی اختیار کرے گا تو دین اس پر غالب آ جائے گا ( اور اس کی سختی نہ چل سکے گی ) پس ( اس لیے ) اپنے عمل میں پختگی اختیار کرو ۔ اور جہاں تک ممکن ہو میانہ روی برتو اور خوش ہو جاؤ ( کہ اس طرز عمل سے تم کو دارین کے فوائد حاصل ہوں گے ) اور صبح اور دوپہر اور شام اور کسی قدر رات میں ( عبادت سے ) مدد حاصل کرو ۔ ( نماز پنج وقتہ بھی مراد ہو سکتی ہے کہ پابندی سے ادا کرو ۔ )",
        "urduNarrator": "ہم سے عبدالسلام بن مطہر نے بیان کیا ، انھوں نے کہا کہ ہم کو عمر بن علی نے معن بن محمد غفاری سے خبر دی ، وہ سعید بن ابوسعید مقبری سے ، وہ ابوہریرہ سے کہ",
        "hadithArabic": "حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ مُطَهَّرٍ، قَالَ حَدَّثَنَا عُمَرُ بْنُ عَلِيٍّ، عَنْ مَعْنِ بْنِ مُحَمَّدٍ الْغِفَارِيِّ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏ \"‏ إِنَّ الدِّينَ يُسْرٌ، وَلَنْ يُشَادَّ الدِّينَ أَحَدٌ إِلاَّ غَلَبَهُ، فَسَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا، وَاسْتَعِينُوا بِالْغَدْوَةِ وَالرَّوْحَةِ وَشَىْءٍ مِنَ الدُّلْجَةِ ‏\"‏‏.‏",
        "headingArabic": "الدِّينُ يُسْرٌ",
        "headingUrdu": "مذہب بہت آسان ہے۔",
        "headingEnglish": "Religion is very easy",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 40,
        "hadithNumber": "40",
        "englishNarrator": "Narrated Al-Bara' (bin 'Azib):",
        "hadithEnglish": "When the Prophet (ﷺ) came to Medina, he stayed first with his grandfathers or maternal uncles from Ansar. He offered his prayers facing Baitul-Maqdis (Jerusalem) for sixteen or seventeen months, but he wished that he could pray facing the Ka'ba (at Mecca). The first prayer which he offered facing the Ka'ba was the 'Asr prayer in the company of some people. Then one of those who had offered that prayer with him came out and passed by some people in a mosque who were bowing during their prayers (facing Jerusalem). He said addressing them, \"By Allah, I testify that I have prayed with Allah's Messenger (ﷺ) facing Mecca (Ka'ba).' Hearing that, those people changed their direction towards the Ka'ba immediately. Jews and the people of the scriptures used to be pleased to see the Prophet (ﷺ) facing Jerusalem in prayers but when he changed his direction towards the Ka'ba, during the prayers, they disapproved of it. Al-Bara' added, \"Before we changed our direction towards the Ka'ba (Mecca) in prayers, some Muslims had died or had been killed and we did not know what to say about them (regarding their prayers.) Allah then revealed: And Allah would never make your faith (prayers) to be lost (i.e. the prayers of those Muslims were valid).' \" (2:143).",
        "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب مدینہ تشریف لائے تو پہلے اپنی نانہال میں اترے ، جو انصار تھے ۔ اور وہاں آپ صلی اللہ علیہ وسلم نے سولہ یا سترہ ماہ بیت المقدس کی طرف منہ کر کے نماز پڑھی اور آپ صلی اللہ علیہ وسلم کی خواہش تھی کہ آپ کا قبلہ بیت اللہ کی طرف ہو ( جب بیت اللہ کی طرف نماز پڑھنے کا حکم ہو گیا ) تو سب سے پہلی نماز جو آپ صلی اللہ علیہ وسلم نے بیت اللہ کی طرف پڑھی عصر کی نماز تھی ۔ وہاں آپ صلی اللہ علیہ وسلم کے ساتھ لوگوں نے بھی نماز پڑھی ، پھر آپ کے ساتھ نماز پڑھنے والوں میں سے ایک آدمی نکلا اور اس کا مسجد ( بنی حارثہ ) کی طرف گزر ہوا تو وہ لوگ رکوع میں تھے ۔ وہ بولا کہ میں اللہ کی گواہی دیتا ہوں کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کے ساتھ مکہ کی طرف منہ کر کے نماز پڑھی ہے ۔ ( یہ سن کر ) وہ لوگ اسی حالت میں بیت اللہ کی طرف گھوم گئے اور جب رسول اللہ صلی اللہ علیہ وسلم بیت المقدس کی طرف منہ کر کے نماز پڑھا کرتے تھے ، یہود اور عیسائی خوش ہوتے تھے مگر جب آپ صلی اللہ علیہ وسلم نے بیت اللہ کی طرف منہ پھیر لیا تو انہیں یہ امر ناگوار ہوا ۔ زہیر ( ایک راوی ) کہتے ہیں کہ ہم سے ابواسحاق نے براء سے یہ حدیث بھی نقل کی ہے کہ قبلہ کی تبدیلی سے پہلے کچھ مسلمان انتقال کر چکے تھے ۔ تو ہمیں یہ معلوم نہ ہو سکا کہ ان کی نمازوں کے بارے میں کیا کہیں ۔ تب اللہ نے یہ آیت نازل کی «وما كان الله ليضيع إيمانكم‏» ( البقرہ : 143 ) ۔",
        "urduNarrator": "ہم سے عمرو بن خالد نے بیان کیا ، انھوں نے کہا ہم سے زہیر نے بیان کیا ، انھوں نے کہا ہم سے ابواسحاق نے بیان کیا ، ان کو حضرت براء بن عازب رضی اللہ عنہ نے خبر دی کہ",
        "hadithArabic": "حَدَّثَنَا عَمْرُو بْنُ خَالِدٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ أَوَّلَ مَا قَدِمَ الْمَدِينَةَ نَزَلَ عَلَى أَجْدَادِهِ ـ أَوْ قَالَ أَخْوَالِهِ ـ مِنَ الأَنْصَارِ، وَأَنَّهُ صَلَّى قِبَلَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا، أَوْ سَبْعَةَ عَشَرَ شَهْرًا، وَكَانَ يُعْجِبُهُ أَنْ تَكُونَ قِبْلَتُهُ قِبَلَ الْبَيْتِ، وَأَنَّهُ صَلَّى أَوَّلَ صَلاَةٍ صَلاَّهَا صَلاَةَ الْعَصْرِ، وَصَلَّى مَعَهُ قَوْمٌ، فَخَرَجَ رَجُلٌ مِمَّنْ صَلَّى مَعَهُ، فَمَرَّ عَلَى أَهْلِ مَسْجِدٍ، وَهُمْ رَاكِعُونَ فَقَالَ أَشْهَدُ بِاللَّهِ لَقَدْ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قِبَلَ مَكَّةَ، فَدَارُوا كَمَا هُمْ قِبَلَ الْبَيْتِ، وَكَانَتِ الْيَهُودُ قَدْ أَعْجَبَهُمْ إِذْ كَانَ يُصَلِّي قِبَلَ بَيْتِ الْمَقْدِسِ، وَأَهْلُ الْكِتَابِ، فَلَمَّا وَلَّى وَجْهَهُ قِبَلَ الْبَيْتِ أَنْكَرُوا ذَلِكَ‏.‏ قَالَ زُهَيْرٌ حَدَّثَنَا أَبُو إِسْحَاقَ عَنِ الْبَرَاءِ فِي حَدِيثِهِ هَذَا أَنَّهُ مَاتَ عَلَى الْقِبْلَةِ قَبْلَ أَنْ تُحَوَّلَ رِجَالٌ وَقُتِلُوا، فَلَمْ نَدْرِ مَا نَقُولُ فِيهِمْ، فَأَنْزَلَ اللَّهُ تَعَالَى ‏{‏وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ‏}‏",
        "headingArabic": "الصَّلاَةُ مِنَ الإِيمَانِ",
        "headingUrdu": "نماز (کی ادائیگی) ایمان کا حصہ ہے۔",
        "headingEnglish": "The (offering of) Salat (prayers) is a part of faith",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 41,
        "hadithNumber": "41",
        "englishNarrator": "Narrated Abu Sa'id Al Khudri:",
        "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If a person embraces Islam sincerely, then Allah shall forgive all his past sins, and after that starts the settlement of accounts, the reward of his good deeds will be ten times to seven hundred times for each good deed and one evil deed will be recorded as it is unless Allah forgives it.\"",
        "hadithUrdu": "انھوں نے رسول اللہ صلی اللہ علیہ وسلم کو یہ ارشاد فرماتے ہوئے سنا کہ جب ( ایک ) بندہ مسلمان ہو جائے اور اس کا اسلام عمدہ ہو ( یقین و خلوص کے ساتھ ہو ) تو اللہ اس کے گناہ کو جو اس نے اس ( اسلام لانے ) سے پہلے کیا معاف فرما دیتا ہے اور اب اس کے بعد کے لیے بدلا شروع ہو جاتا ہے ( یعنی ) ایک نیکی کے عوض دس گنا سے لے کر سات سو گنا تک ( ثواب ) اور ایک برائی کا اسی برائی کے مطابق ( بدلا دیا جاتا ہے ) مگر یہ کہ اللہ تعالیٰ اس برائی سے بھی درگزر کرے ۔ ( اور اسے بھی معاف فرما دے ۔ یہ بھی اس کے لیے آسان ہے ۔ )",
        "urduNarrator": "امام مالک رحمہ اللہ کہتے ہیں مجھے زید بن اسلم نے خبر دی ، انہیں عطاء بن یسار نے ، ان کو ابو سعید خدری رضی اللہ عنہ نے بتایا کہ",
        "hadithArabic": "قَالَ مَالِكٌ أَخْبَرَنِي زَيْدُ بْنُ أَسْلَمَ، أَنَّ عَطَاءَ بْنَ يَسَارٍ، أَخْبَرَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ أَخْبَرَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِذَا أَسْلَمَ الْعَبْدُ فَحَسُنَ إِسْلاَمُهُ يُكَفِّرُ اللَّهُ عَنْهُ كُلَّ سَيِّئَةٍ كَانَ زَلَفَهَا، وَكَانَ بَعْدَ ذَلِكَ الْقِصَاصُ، الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ، وَالسَّيِّئَةُ بِمِثْلِهَا إِلاَّ أَنْ يَتَجَاوَزَ اللَّهُ عَنْهَا ‏\"‏‏.‏",
        "headingArabic": "حُسْنِ إِسْلاَمِ الْمَرْءِ",
        "headingUrdu": "(اس کی برتری کے بارے میں کیا کہا جاتا ہے) جو شخص سچے دل سے اسلام قبول کرتا ہے۔",
        "headingEnglish": "(What is said regarding the superiority of) a person who embraces Islam sincerely.",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 42,
        "hadithNumber": "42",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "Allah's Messenger (ﷺ) said, \"If any one of you improve (follows strictly) his Islamic religion then his good deeds will be rewarded ten times to seven hundred times for each good deed and a bad deed will be recorded as it is.\"",
        "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ تم میں سے کوئی شخص جب اپنے اسلام کو عمدہ بنا لے ( یعنی نفاق اور ریا سے پاک کر لے ) تو ہر نیک کام جو وہ کرتا ہے اس کے عوض دس سے لے کر سات سو گنا تک نیکیاں لکھی جاتی ہیں اور ہر برا کام جو کرتا ہے تو وہ اتنا ہی لکھا جاتا ہے ( جتنا کہ اس نے کیا ہے ) ۔",
        "urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا ، ان سے عبدالرزاق نے ، انہیں معمر نے ہمام سے خبر دی ، وہ حضرت ابوہریرہ رضی اللہ عنہ سے نقل کرتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ إِذَا أَحْسَنَ أَحَدُكُمْ إِسْلاَمَهُ، فَكُلُّ حَسَنَةٍ يَعْمَلُهَا تُكْتَبُ لَهُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ، وَكُلُّ سَيِّئَةٍ يَعْمَلُهَا تُكْتَبُ لَهُ بِمِثْلِهَا ‏\"‏‏.‏",
        "headingArabic": null,
        "headingUrdu": null,
        "headingEnglish": null,
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 43,
        "hadithNumber": "43",
        "englishNarrator": "Narrated 'Aisha:",
        "hadithEnglish": "Once the Prophet (ﷺ) came while a woman was sitting with me. He said, \"Who is she?\" I replied, \"She is so and so,\" and told him about her (excessive) praying. He said disapprovingly, \"Do (good) deeds which is within your capacity (without being overtaxed) as Allah does not get tired (of giving rewards) but (surely) you will get tired and the best deed (act of Worship) in the sight of Allah is that which is done regularly.\"",
        "hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( ایک دن ) ان کے پاس آئے ، اس وقت ایک عورت میرے پاس بیٹھی تھی ، آپ نے دریافت کیا یہ کون ہے ؟ میں نے عرض کیا ، فلاں عورت اور اس کی نماز ( کے اشتیاق اور پابندی ) کا ذکر کیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا ٹھہر جاؤ ( سن لو کہ ) تم پر اتنا ہی عمل واجب ہے جتنے عمل کی تمہارے اندر طاقت ہے ۔ خدا کی قسم ( ثواب دینے سے ) اللہ نہیں اکتاتا ، مگر تم ( عمل کرتے کرتے ) اکتا جاؤ گے ، اور اللہ کو دین ( کا ) وہی عمل زیادہ پسند ہے جس کی ہمیشہ پابندی کی جا سکے ۔ ( اور انسان بغیر اکتائے اسے انجام دے ) ۔",
        "urduNarrator": "ہم سے محمد بن المثنی نے بیان کیا ، ان سے یحییٰ نے ہشام کے واسطے سے نقل کیا ، وہ کہتے ہیں مجھے میرے باپ ( عروہ ) نے حضرت عائشہ رضی اللہ عنہا سے روایت نقل کی کہ",
        "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم دَخَلَ عَلَيْهَا وَعِنْدَهَا امْرَأَةٌ قَالَ ‏\"‏ مَنْ هَذِهِ ‏\"‏‏.‏ قَالَتْ فُلاَنَةُ‏.‏ تَذْكُرُ مِنْ صَلاَتِهَا‏.‏ قَالَ ‏\"‏ مَهْ، عَلَيْكُمْ بِمَا تُطِيقُونَ، فَوَاللَّهِ لاَ يَمَلُّ اللَّهُ حَتَّى تَمَلُّوا ‏\"‏‏.‏ وَكَانَ أَحَبَّ الدِّينِ إِلَيْهِ مَا دَامَ عَلَيْهِ صَاحِبُهُ‏.‏",
        "headingArabic": "أَحَبُّ الدِّينِ إِلَى اللَّهِ أَدْوَمُهُ",
        "headingUrdu": "اللہ جل جلالہ کو سب سے زیادہ محبوب الدین وہ ہے جو باقاعدگی سے کیا جائے۔ (اور حقیقت میں اللہ کے نزدیک بہترین دین اسلام ہے)",
        "headingEnglish": "Ad-Din (good, righteous deed - act of worship) loved most by Allah Jalla Jalalahu is that which is done regularly. (And in fact the best religion with Allah is Islam)",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 44,
        "hadithNumber": "44",
        "englishNarrator": "Narrated Anas:",
        "hadithEnglish": "The Prophet (ﷺ) said, \"Whoever said \"None has the right to be worshipped but Allah and has in his heart good (faith) equal to the weight of a barley grain will be taken out of Hell. And whoever said: \"None has the right to be worshipped but Allah and has in his heart good (faith) equal to the weight of a wheat grain will be taken out of Hell. And whoever said, \"None has the right to be worshipped but Allah and has in his heart good (faith) equal to the weight of an atom will be taken out of Hell.\"",
        "hadithUrdu": "آپ صلی اللہ علیہ وسلم نے فرمایا جس شخص نے «لا إله إلا الله» کہہ لیا اور اس کے دل میں جو برابر بھی ( ایمان ) ہے تو وہ ( ایک نہ ایک دن ) دوزخ سے ضرور نکلے گا اور دوزخ سے وہ شخص ( بھی ) ضرور نکلے گا جس نے کلمہ پڑھا اور اس کے دل میں گیہوں کے دانہ برابر خیر ہے اور دوزخ سے وہ ( بھی ) نکلے گا جس نے کلمہ پڑھا اور اس کے دل میں اک ذرہ برابر بھی خیر ہے ۔ حضرت امام ابوعبداللہ بخاری رحمہ اللہ فرماتے ہیں کہ ابان نے بروایت قتادہ بواسطہ حضرت انس رضی اللہ عنہ رسول صلی اللہ علیہ وسلم سے «خير» کی جگہ «ايمان» کا لفظ نقل کیا ہے ۔",
        "urduNarrator": "ہم سے مسلم بن ابراہیم نے بیان کیا ، ان سے ہشام نے ، ان سے قتادہ نے حضرت انس کے واسطے سے نقل کیا ، وہ رسول اللہ صلی اللہ علیہ وسلم سے روایت کرتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ يَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَفِي قَلْبِهِ وَزْنُ شَعِيرَةٍ مِنْ خَيْرٍ، وَيَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَفِي قَلْبِهِ وَزْنُ بُرَّةٍ مِنْ خَيْرٍ، وَيَخْرُجُ مِنَ النَّارِ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ، وَفِي قَلْبِهِ وَزْنُ ذَرَّةٍ مِنْ خَيْرٍ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ قَالَ أَبَانُ حَدَّثَنَا قَتَادَةُ حَدَّثَنَا أَنَسٌ عَنِ النَّبِيِّ صلى الله عليه وسلم ‏\"‏ مِنْ إِيمَانٍ ‏\"‏‏.‏ مَكَانَ ‏\"‏ مِنْ خَيْرٍ ‏\"‏‏.‏",
        "headingArabic": "زِيَادَةِ الإِيمَانِ وَنُقْصَانِهِ",
        "headingUrdu": "ایمان بڑھتا اور گھٹتا ہے۔",
        "headingEnglish": "Faith increases and decreases",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 45,
        "hadithNumber": "45",
        "englishNarrator": "Narrated 'Umar bin Al-Khattab:",
        "hadithEnglish": "Once a Jew said to me, \"O the chief of believers! There is a verse in your Holy Book Which is read by all of you (Muslims), and had it been revealed to us, we would have taken that day (on which it was revealed as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that verse?\" The Jew replied, \"This day I have perfected your religion For you, completed My favor upon you, And have chosen for you Islam as your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where this verse was revealed to the Prophet. It was Friday and the Prophet (ﷺ) was standing at 'Arafat (i.e. the Day of Hajj)\"",
        "hadithUrdu": "ایک یہودی نے ان سے کہا کہ اے امیرالمؤمنین ! تمہاری کتاب ( قرآن ) میں ایک آیت ہے جسے تم پڑھتے ہو ۔ اگر وہ ہم یہودیوں پر نازل ہوتی تو ہم اس ( کے نزول کے ) دن کو یوم عید بنا لیتے ۔ آپ نے پوچھا وہ کون سی آیت ہے ؟ اس نے جواب دیا ( سورۃ المائدہ کی یہ آیت کہ ) ’’ آج میں نے تمہارے دین کو مکمل کر دیا اور اپنی نعمت تم پر تمام کر دی اور تمہارے لیے دین اسلام پسند کیا ‘‘ حضرت عمر رضی اللہ عنہ نے فرمایا کہ ہم اس دن اور اس مقام کو ( خوب ) جانتے ہیں جب یہ آیت رسول اللہ صلی اللہ علیہ وسلم پر نازل ہوئی ( اس وقت ) آپ صلی اللہ علیہ وسلم عرفات میں جمعہ کے دن کھڑے ہوئے تھے ۔",
        "urduNarrator": "ہم سے اس حدیث کو حسن بن صباح نے بیان کیا ، انھوں نے جعفر بن عون سے سنا ، وہ ابوالعمیس سے بیان کرتے ہیں ، انہیں قیس بن مسلم نے طارق بن شہاب کے واسطے سے خبر دی ۔ وہ حضرت عمر بن خطاب رضی اللہ عنہ سے روایت کرتے ہیں کہ",
        "hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ الصَّبَّاحِ، سَمِعَ جَعْفَرَ بْنَ عَوْنٍ، حَدَّثَنَا أَبُو الْعُمَيْسِ، أَخْبَرَنَا قَيْسُ بْنُ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، أَنَّ رَجُلاً، مِنَ الْيَهُودِ قَالَ لَهُ يَا أَمِيرَ الْمُؤْمِنِينَ، آيَةٌ فِي كِتَابِكُمْ تَقْرَءُونَهَا لَوْ عَلَيْنَا مَعْشَرَ الْيَهُودِ نَزَلَتْ لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا‏.‏ قَالَ أَىُّ آيَةٍ قَالَ ‏{‏الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الإِسْلاَمَ دِينًا‏}‏‏.‏ قَالَ عُمَرُ قَدْ عَرَفْنَا ذَلِكَ الْيَوْمَ وَالْمَكَانَ الَّذِي نَزَلَتْ فِيهِ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ قَائِمٌ بِعَرَفَةَ يَوْمَ جُمُعَةٍ‏.‏",
        "headingArabic": null,
        "headingUrdu": null,
        "headingEnglish": null,
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 46,
        "hadithNumber": "46",
        "englishNarrator": "Narrated Talha bin 'Ubaidullah:",
        "hadithEnglish": "A man from Najd with unkempt hair came to Allah's Messenger (ﷺ) and we heard his loud voice but could not understand what he was saying, till he came near and then we came to know that he was asking about Islam. Allah's Messenger (ﷺ) said, \"You have to offer prayers perfectly five times in a day and night (24 hours).\" The man asked, \"Is there any more (praying)?\" Allah's Messenger (ﷺ) replied, \"No, but if you want to offer the Nawafil prayers (you can).\" Allah's Messenger (ﷺ) further said to him: \"You have to observe fasts during the month of Ramadan.\" The man asked, \"Is there any more fasting?\" Allah's Messenger (ﷺ) replied, \"No, but if you want to observe the Nawafil fasts (you can.)\" Then Allah's Messenger (ﷺ) further said to him, \"You have to pay the Zakat (obligatory charity).\" The man asked, \"Is there any thing other than the Zakat for me to pay?\" Allah's Messenger (ﷺ) replied, \"No, unless you want to give alms of your own.\" And then that man retreated saying, \"By Allah! I will neither do less nor more than this.\" Allah's Messenger (ﷺ) said, \"If what he said is true, then he will be successful (i.e. he will be granted Paradise).\"",
        "hadithUrdu": "نجد والوں میں ایک شخص آنحضرت صلی اللہ علیہ وسلم کے پاس آیا ، سر پریشان یعنی بال بکھرے ہوئے تھے ، ہم اس کی آواز کی بھنبھناہٹ سنتے تھے اور ہم سمجھ نہیں پا رہے تھے کہ وہ کیا کہہ رہا ہے ۔ یہاں تک کہ وہ نزدیک آن پہنچا ، جب معلوم ہوا کہ وہ اسلام کے بارے میں پوچھ رہا ہے ۔ آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ اسلام دن رات میں پانچ نمازیں پڑھنا ہے ، اس نے کہا بس اس کے سوا تو اور کوئی نماز مجھ پر نہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں مگر تو نفل پڑھے ( تو اور بات ہے ) آنحضرت صلی اللہ علیہ وسلم نے فرمایا اور رمضان کے روزے رکھنا ۔ اس نے کہا اور تو کوئی روزہ مجھ پر نہیں ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں مگر تو نفل روزے رکھے ( تو اور بات ہے ) طلحہ نے کہا اور آنحضرت صلی اللہ علیہ وسلم نے اس سے زکوٰۃ کا بیان کیا ۔ وہ کہنے لگا کہ بس اور کوئی صدقہ مجھ پر نہیں ہے ۔ آپ صلی اللہ علیہ وسلم نے فرمایا نہیں مگر یہ کہ تو نفل صدقہ دے ( تو اور بات ہے ) راوی نے کہا پھر وہ شخص پیٹھ موڑ کر چلا ۔ یوں کہتا جاتا تھا ، قسم خدا کی میں نہ اس سے بڑھاؤں گا نہ گھٹاؤں گا ، آنحضرت صلی اللہ علیہ وسلم نے فرمایا اگر یہ سچا ہے تو اپنی مراد کو پہنچ گیا ۔",
        "urduNarrator": "ہم سے اسماعیل نے بیان کیا ، کہا مجھ سے امام مالک رحمہ اللہ نے بیان کیا ، انھوں نے اپنے چچا ابوسہیل بن مالک سے ، انھوں نے اپنے باپ ( مالک بن ابی عامر ) سے ، انھوں نے طلحہ بن عبیداللہ سے وہ کہتے تھے",
        "hadithArabic": "حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، يَقُولُ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ أَهْلِ نَجْدٍ، ثَائِرُ الرَّأْسِ، يُسْمَعُ دَوِيُّ صَوْتِهِ، وَلاَ يُفْقَهُ مَا يَقُولُ حَتَّى دَنَا، فَإِذَا هُوَ يَسْأَلُ عَنِ الإِسْلاَمِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ‏\"‏ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ ‏\"‏‏.‏ فَقَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏\"‏‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ وَصِيَامُ رَمَضَانَ ‏\"‏‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهُ قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏\"‏‏.‏ قَالَ وَذَكَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم الزَّكَاةَ‏.‏ قَالَ هَلْ عَلَىَّ غَيْرُهَا قَالَ ‏\"‏ لاَ، إِلاَّ أَنْ تَطَوَّعَ ‏\"‏‏.‏ قَالَ فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ وَاللَّهِ لاَ أَزِيدُ عَلَى هَذَا وَلاَ أَنْقُصُ‏.‏ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\"‏ أَفْلَحَ إِنْ صَدَقَ ‏\"‏‏.‏",
        "headingArabic": "الزَّكَاةُ مِنَ الإِسْلاَمِ",
        "headingUrdu": "زکوٰۃ ادا کرنا اسلام کا حصہ ہے۔",
        "headingEnglish": "To pay Zakat is a part of Islam",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 47,
        "hadithNumber": "47",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "Allah's Messenger (ﷺ) said, \"(A believer) who accompanies the funeral procession of a Muslim out of sincere faith and hoping to attain Allah's reward and remains with it till the funeral prayer is offered and the burial ceremonies are over, he will return with a reward of two Qirats. Each Qirat is like the size of the (Mount) Uhud. He who offers the funeral prayer only and returns before the burial, will return with the reward of one Qirat only.\"",
        "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا ، جو کوئی ایمان رکھ کر اور ثواب کی نیت سے کسی مسلمان کے جنازے کے ساتھ جائے اور نماز اور دفن سے فراغت ہونے تک اس کے ساتھ رہے تو وہ دو قیراط ثواب لے کر لوٹے گا ہر قیراط اتنا بڑا ہو گا جیسے احد کا پہاڑ ، اور جو شخص جنازے پر نماز پڑھ کر دفن سے پہلے لوٹ جائے تو وہ ایک قیراط ثواب لے کر لوٹے گا ۔ روح کے ساتھ اس حدیث کو عثمان مؤذن نے بھی روایت کیا ہے ۔ کہا ہم سے عوف نے بیان کیا ، انھوں نے محمد بن سیرین سے سنا ، انھوں نے ابوہریرہ رضی اللہ عنہ سے ، انھوں نے آنحضرت صلی اللہ علیہ وسلم سے اگلی روایت کی طرح ۔",
        "urduNarrator": "ہم سے احمد بن عبداللہ بن علی منجونی نے بیان کیا ، کہا ہم سے روح نے بیان کیا ، کہا ہم سے عوف نے بیان کیا ، انھوں نے حسن بصری اور محمد بن سیرین سے ، انھوں نے ابوہریرہ رضی اللہ عنہ سے کہ",
        "hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ عَلِيٍّ الْمَنْجُوفِيُّ، قَالَ حَدَّثَنَا رَوْحٌ، قَالَ حَدَّثَنَا عَوْفٌ، عَنِ الْحَسَنِ، وَمُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏ \"‏ مَنِ اتَّبَعَ جَنَازَةَ مُسْلِمٍ إِيمَانًا وَاحْتِسَابًا، وَكَانَ مَعَهُ حَتَّى يُصَلَّى عَلَيْهَا، وَيَفْرُغَ مِنْ دَفْنِهَا، فَإِنَّهُ يَرْجِعُ مِنَ الأَجْرِ بِقِيرَاطَيْنِ، كُلُّ قِيرَاطٍ مِثْلُ أُحُدٍ، وَمَنْ صَلَّى عَلَيْهَا ثُمَّ رَجَعَ قَبْلَ أَنْ تُدْفَنَ فَإِنَّهُ يَرْجِعُ بِقِيرَاطٍ ‏\"‏‏.‏ تَابَعَهُ عُثْمَانُ الْمُؤَذِّنُ قَالَ حَدَّثَنَا عَوْفٌ عَنْ مُحَمَّدٍ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ‏.‏",
        "headingArabic": "اتِّبَاعُ الْجَنَائِزِ مِنَ الإِيمَانِ",
        "headingUrdu": "جنازے کے جلوسوں کے ساتھ (دفن کی جگہ تک) جانا ایمان کا حصہ ہے۔",
        "headingEnglish": "To accompany the funeral processions (up to the place of burial) is a part of faith",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 48,
        "hadithNumber": "48",
        "englishNarrator": "Narrated 'Abdullah:",
        "hadithEnglish": "The Prophet (ﷺ) said, \"Abusing a Muslim is Fusuq (an evil doing) and killing him is Kufr (disbelief).\"",
        "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ مسلمان کو گالی دینے سے آدمی فاسق ہو جاتا ہے اور مسلمان سے لڑنا کفر ہے ۔",
        "urduNarrator": "ہم سے محمد بن عرعرہ نے بیان کیا ، وہ کہتے ہیں کہ ہم سے شعبہ نے بیان کیا ، انھوں نے زبید بن حارث سے ، کہا میں نے ابووائل سے مرجیہ کے بارے میں پوچھا ، ( وہ کہتے ہیں گناہ سے آدمی فاسق نہیں ہوتا ) انھوں نے کہا کہ مجھ سے عبداللہ بن مسعود رضی اللہ عنہما نے بیان کیا کہ",
        "hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَرْعَرَةَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ زُبَيْدٍ، قَالَ سَأَلْتُ أَبَا وَائِلٍ عَنِ الْمُرْجِئَةِ،، فَقَالَ حَدَّثَنِي عَبْدُ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ ‏ \"‏ سِبَابُ الْمُسْلِمِ فُسُوقٌ، وَقِتَالُهُ كُفْرٌ ‏\"‏‏.‏",
        "headingArabic": "خَوْفِ الْمُؤْمِنِ مِنْ أَنْ يَحْبَطَ عَمَلُهُ وَهُوَ لاَ يَشْعُرُ",
        "headingUrdu": "مومن کا یہ خوف کہ اس کے علم کے بغیر اس کی نیکیاں ضائع ہو جائیں",
        "headingEnglish": "(What is said regarding) the fear of a believer that his good deeds may be annulled (lost) without his knowledge",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 49,
        "hadithNumber": "49",
        "englishNarrator": "Narrated 'Ubada bin As-Samit:",
        "hadithEnglish": "\"Allah's Messenger (ﷺ) went out to inform the people about the (date of the) night of decree (Al-Qadr) but there happened a quarrel between two Muslim men. The Prophet (ﷺ) said, \"I came out to inform you about (the date of) the night of Al-Qadr, but as so and so and so and so quarrelled, its knowledge was taken away (I forgot it) and maybe it was better for you. Now look for it in the 7th, the 9th and the 5th (of the last 10 nights of the month of Ramadan).\"",
        "hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم اپنے حجرے سے نکلے ، لوگوں کو شب قدر بتانا چاہتے تھے ( وہ کون سی رات ہے ) اتنے میں دو مسلمان آپس میں لڑ پڑے ، آپ صلی اللہ علیہ وسلم نے فرمایا ، میں تو اس لیے باہر نکلا تھا کہ تم کو شب قدر بتلاؤں اور فلاں فلاں آدمی لڑ پڑے تو وہ میرے دل سے اٹھا لی گئی اور شاید اسی میں کچھ تمہاری بہتری ہو ۔ ( تو اب ایسا کرو کہ ) شب قدر کو رمضان کی ستائیسویں ، انتیسویں و پچیسویں رات میں ڈھونڈا کرو ۔",
        "urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا ، کہا ہم سے اسماعیل بن جعفر نے بیان کیا ، انھوں نے حمید سے ، انھوں نے انس رضی اللہ عنہ سے ، کہا مجھ کو عبادہ بن صامت نے خبر دی کہ",
        "hadithArabic": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَخْبَرَنِي عُبَادَةُ بْنُ الصَّامِتِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ يُخْبِرُ بِلَيْلَةِ الْقَدْرِ، فَتَلاَحَى رَجُلاَنِ مِنَ الْمُسْلِمِينَ فَقَالَ ‏ \"‏ إِنِّي خَرَجْتُ لأُخْبِرَكُمْ بِلَيْلَةِ الْقَدْرِ، وَإِنَّهُ تَلاَحَى فُلاَنٌ وَفُلاَنٌ فَرُفِعَتْ وَعَسَى أَنْ يَكُونَ خَيْرًا لَكُمُ الْتَمِسُوهَا فِي السَّبْعِ وَالتِّسْعِ وَالْخَمْسِ ‏\"‏‏.‏",
        "headingArabic": null,
        "headingUrdu": null,
        "headingEnglish": null,
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      },
      {
        "id": 50,
        "hadithNumber": "50",
        "englishNarrator": "Narrated Abu Huraira:",
        "hadithEnglish": "One day while the Prophet (ﷺ) was sitting in the company of some people, (The angel) Gabriel came and asked, \"What is faith?\" Allah's Messenger (ﷺ) replied, 'Faith is to believe in Allah, His angels, (the) meeting with Him, His Apostles, and to believe in Resurrection.\" Then he further asked, \"What is Islam?\" Allah's Messenger (ﷺ) replied, \"To worship Allah Alone and none else, to offer prayers perfectly to pay the compulsory charity (Zakat) and to observe fasts during the month of Ramadan.\" Then he further asked, \"What is Ihsan (perfection)?\" Allah's Messenger (ﷺ) replied, \"To worship Allah as if you see Him, and if you cannot achieve this state of devotion then you must consider that He is looking at you.\" Then he further asked, \"When will the Hour be established?\" Allah's Messenger (ﷺ) replied, \"The answerer has no better knowledge than the questioner. But I will inform you about its portents. 1. When a slave (lady) gives birth to her master. 2. When the shepherds of black camels start boasting and competing with others in the construction of higher buildings. And the Hour is one of five things which nobody knows except Allah. The Prophet (ﷺ) then recited: \"Verily, with Allah (Alone) is the knowledge of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet (ﷺ) asked his companions to call him back, but they could not see him. Then the Prophet (ﷺ) said, \"That was Gabriel who came to teach the people their religion.\" Abu 'Abdullah said: He (the Prophet) considered all that as a part of faith.",
        "hadithUrdu": "ایک دن آنحضرت صلی اللہ علیہ وسلم لوگوں میں تشریف فرما تھے کہ آپ کے پاس ایک شخص آیا اور پوچھنے لگا کہ ایمان کسے کہتے ہیں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ایمان یہ ہے کہ تم اللہ پاک کے وجود اور اس کی وحدانیت پر ایمان لاؤ اور اس کے فرشتوں کے وجود پر اور اس ( اللہ ) کی ملاقات کے برحق ہونے پر اور اس کے رسولوں کے برحق ہونے پر اور مرنے کے بعد دوبارہ اٹھنے پر ایمان لاؤ ۔ پھر اس نے پوچھا کہ اسلام کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے پھر جواب دیا کہ اسلام یہ ہے کہ تم خالص اللہ کی عبادت کرو اور اس کے ساتھ کسی کو شریک نہ بناؤ اور نماز قائم کرو ۔ اور زکوٰۃ فرض ادا کرو ۔ اور رمضان کے روزے رکھو ۔ پھر اس نے احسان کے متعلق پوچھا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا احسان یہ کہ تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو اگر یہ درجہ نہ حاصل ہو تو پھر یہ تو سمجھو کہ وہ تم کو دیکھ رہا ہے ۔ پھر اس نے پوچھا کہ قیامت کب آئے گی ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اس کے بارے میں جواب دینے والا پوچھنے والے سے کچھ زیادہ نہیں جانتا ( البتہ ) میں تمہیں اس کی نشانیاں بتلا سکتا ہوں ۔ وہ یہ ہیں کہ جب لونڈی اپنے آقا کو جنے گی اور جب سیاہ اونٹوں کے چرانے والے ( دیہاتی لوگ ترقی کرتے کرتے ) مکانات کی تعمیر میں ایک دوسرے سے بازی لے جانے کی کوشش کریں گے ( یاد رکھو ) قیامت کا علم ان پانچ چیزوں میں ہے جن کو اللہ کے سوا کوئی نہیں جانتا ۔ پھر آپ نے یہ آیت پڑھی کہ اللہ ہی کو قیامت کا علم ہے کہ وہ کب ہو گی ( آخر آیت تک ) پھر وہ پوچھنے والا پیٹھ پھیر کر جانے لگا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ اسے واپس بلا کر لاؤ ۔ لوگ دوڑ پڑے مگر وہ کہیں نظر نہیں آیا ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ وہ جبرائیل تھے جو لوگوں کو ان کا دین سکھانے آئے تھے ۔ امام ابوعبداللہ بخاری فرماتے ہیں کہ آنحضرت صلی اللہ علیہ وسلم نے ان تمام باتوں کو ایمان ہی قرار دیا ہے ۔",
        "urduNarrator": "ہم سے مسدد نے بیان کیا ، انھوں نے کہا کہ ہم سے اسماعیل بن ابراہیم نے بیان کیا ، انھوں نے کہا کہ ہم کو ابوحیان تیمی نے ابوزرعہ سے خبر دی ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے نقل کیا کہ",
        "hadithArabic": "حَدَّثَنَا مُسَدَّدٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو حَيَّانَ التَّيْمِيُّ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم بَارِزًا يَوْمًا لِلنَّاسِ، فَأَتَاهُ جِبْرِيلُ فَقَالَ مَا الإِيمَانُ قَالَ ‏\"‏ الإِيمَانُ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَبِلِقَائِهِ وَرُسُلِهِ، وَتُؤْمِنَ بِالْبَعْثِ ‏\"‏‏.‏ قَالَ مَا الإِسْلاَمُ قَالَ ‏\"‏ الإِسْلاَمُ أَنْ تَعْبُدَ اللَّهَ وَلاَ تُشْرِكَ بِهِ، وَتُقِيمَ الصَّلاَةَ، وَتُؤَدِّيَ الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومَ رَمَضَانَ ‏\"‏‏.‏ قَالَ مَا الإِحْسَانُ قَالَ ‏\"‏ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ ‏\"‏‏.‏ قَالَ مَتَى السَّاعَةُ قَالَ ‏\"‏ مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَسَأُخْبِرُكَ عَنْ أَشْرَاطِهَا إِذَا وَلَدَتِ الأَمَةُ رَبَّهَا، وَإِذَا تَطَاوَلَ رُعَاةُ الإِبِلِ الْبُهْمُ فِي الْبُنْيَانِ، فِي خَمْسٍ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ ‏\"‏‏.‏ ثُمَّ تَلاَ النَّبِيُّ صلى الله عليه وسلم ‏{‏إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ‏}‏ الآيَةَ‏.‏ ثُمَّ أَدْبَرَ فَقَالَ ‏\"‏ رُدُّوهُ ‏\"‏‏.‏ فَلَمْ يَرَوْا شَيْئًا‏.‏ فَقَالَ ‏\"‏ هَذَا جِبْرِيلُ جَاءَ يُعَلِّمُ النَّاسَ دِينَهُمْ ‏\"‏‏.‏ قَالَ أَبُو عَبْدِ اللَّهِ جَعَلَ ذَلِكَ كُلَّهُ مِنَ الإِيمَانِ‏.‏",
        "headingArabic": "سُؤَالِ جِبْرِيلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنِ الإِيمَانِ وَالإِسْلاَمِ وَالإِحْسَانِ وَعِلْمِ السَّاعَةِ",
        "headingUrdu": "جبرائیل علیہ السلام کا رسول اللہ صلی اللہ علیہ وسلم سے ایمان، اسلام، احسان اور قیامت کے علم کے بارے میں سوال",
        "headingEnglish": "The asking of (angel) Jibrll (Gabriel) from the Prophet (saws) about Iman, Islam, Ihsan and the knowledge of the Hour",
        "chapterId": "2",
        "bookSlug": "sahih-bukhari",
        "volume": "1",
        "status": "Sahih",
        "book": {
          "id": 1,
          "bookName": "Sahih Bukhari",
          "writerName": "Imam Bukhari",
          "aboutWriter": null,
          "writerDeath": "256 ھ",
          "bookSlug": "sahih-bukhari"
        },
        "chapter": {
          "id": 2,
          "chapterNumber": "2",
          "chapterEnglish": "Belief",
          "chapterUrdu": "ایمان کے بیان میں",
          "chapterArabic": "كتاب الإيمان",
          "bookSlug": "sahih-bukhari"
        }
      }
    ],
    "first_page_url": "https://www.hadithapi.com/public/api/hadiths?page=1",
    "from": 26,
    "last_page": 1629,
    "last_page_url": "https://www.hadithapi.com/public/api/hadiths?page=1629",
    "links": [
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=1",
        "label": "&laquo; Previous",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=1",
        "label": "1",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=2",
        "label": "2",
        "active": true
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=3",
        "label": "3",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=4",
        "label": "4",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=5",
        "label": "5",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=6",
        "label": "6",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=7",
        "label": "7",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=8",
        "label": "8",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=9",
        "label": "9",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=10",
        "label": "10",
        "active": false
      },
      { "url": null, "label": "...", "active": false },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=1628",
        "label": "1628",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=1629",
        "label": "1629",
        "active": false
      },
      {
        "url": "https://www.hadithapi.com/public/api/hadiths?page=3",
        "label": "Next &raquo;",
        "active": false
      }
    ],
    "next_page_url": "https://www.hadithapi.com/public/api/hadiths?page=3",
    "path": "https://www.hadithapi.com/public/api/hadiths",
    "per_page": 25,
    "prev_page_url": "https://www.hadithapi.com/public/api/hadiths?page=1",
    "to": 50,
    "total": 40719
  }
}
